{"data": {"audienceReviews": {"totalCount": 247, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "This movie is entertaining and a bit stressing, but the characters in this film are just either annoying or you just feel bad for them (the very few). But in the end, each segment has a pretty satisfying \"3rd act\"."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "..horrible, worse than viral"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "A true millennial nightmare, this static-filled sequel double dares you to remember the worst parts of the life pre-Y2K."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "It's ok but I don't know if the franchise has fallen off or not."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "The worst of the franchise"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "Felt like each vignette was maybe 5 minutes too long. Practical effects were decent and a good choice.\n\n1. Was fun enough, maybe a few too many fakeouts.\n2. Was pretty low on tension, payoff was ok\n3. Fun, inventive and fucked up.\n4. Stupid\n5. Wait, What?"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Overall, while I've always had this franchise in a special place in my heart, this one is a significant misfire.  While visuals and the V/H/S retro vibes hit strongly once again, the film fails to deliver short stories that hit strongly with creativity. Instead, each story has similarities to the other, and in many instances, the films are just sad and downright depressing. Fans of torture porn will find aspects that are pleasing, but in the end, it all feels rushed, and I could not wait to eject this tape, rewind it and return it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Way better than Viral but weaker than the other entries in the franchise. \"Suicide Bid\" and \"To Hell and Back\" are definitely the star segments of 99. Although \"The Gawkers\" deserves special mention for doing something I've never seen done in found footage....\n***spoiler alert***\n\nMedusa!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "Not the greatest film ever made but definitely one of the most entertaining horror movies of 2022. This anthology ends with a story that I would have sat through a whole movie of."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Really good movie I recommend it, there's not much story telling but its still good."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is the freshest time capsule of the 90s since Empire Records or maybe Suburbia."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Although the V/H/S franchise is becoming slightly repetitive, it is still creative enough to keep its fan base. And the different stories are never predictable. Another hit!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "bored! Need another options out of monsters"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "Mostly what you'd expect from a V/H/S MOVIE, not as good as V/H/S/94 or the second half of V/H/S/2.  The ‘Double Dare' story felt too derivative and subsequently deformed and the final bit could have been more than people in S&M masks supposed to be demons in hell.... very underwhelming trip to hell for the V/H/S franchise."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "V/H/S99 has turned into a movie, so-called V/H/S but consisting only of horror shorts by shelving the classic themes of last year's film. The fact that there is no inner and outer story anymore, that these stories are not combined, that none of the stories benefit from technology, and worse yet, that they do not reflect the period are the developments that upset me, who love the series very freaking much. The series, which had a richer structure under 8383 Productions and The Collective Studios, was simplified under Shudder. It wouldn't be surprising if Shudder, known for its low-budget horrors, would shrink under it, but shrinking the vision may not be good for the series. However, I can say that I would not say no to a possible sequel that will continue to come every October. It's never too late to get back to their roots."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "Not the best in the V/H/S series, but by no means was this a bad film. Aside from the Medusa short, VHS99 did not supply a whole lot of jump scares or concepts to get invested in. Shredding, Suicide Bid, and Ozzy's Dungeon were more exploitation/psychological horror (spamming the use of the obnoxious bully antagonist trope), while To Hell and Back felt pretentious at times and was very hard to buy into. Perhaps it was this lack of variety amongst the shorts, all having relied too heavily on that \"type\" of antagonist. \n\nVHS94's shorts (namely Terror and Storm Drain) were very hard to top from a plot/narrative standpoint, while The Subject absolutely mastered the action-oriented and exploitation themes. So, this VHS99 did feel like a step down in that regard."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Not a fan. Maybe it's just not for me but I like the found footage idea but it's like a collage of different random stories instead of connecting them at the end. I get their trying to combine short stories into one big movie but it comes as boring. It would be like if the twilight zone instead of separating episodes they combined them into a movie. It wouldn't work. What would be a cool idea is if this was a tv show for shudder and seeing different stories that way and breaking them up into individual episodes. In the end they should turn it into a show not a movie.  Oct 21 22"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "VHS99 just like VHS94, is pretty good. I'm not the biggest fan of found footage, or anthology movies, but this one does a pretty good job at it. There's no bookend story which is a positive for me. The last 2 VHS movies, I didn't care for the bookend story's, so I'm glad that's not in this one. There's a good story about a girl getting buried alive, another good one with a hot neighbor that's actually freakin Medusa. And the one about demons was decent. The first story though I didn't like at all. The characters were very annoying. Overall I'd recommend it though."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "The final story was excellent, I'd give that 4 stars.  Hated the rest."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Moment done, enjoyed this, bloody good time."}]}}, "emsId": "07133f2f-80a9-4c62-836c-c886451fbf2b", "emsVersionId": "354108b7-a569-42d3-bb01-4ff1a860148c", "movie_name": "V/H/S/99"}