{"data": {"audienceReviews": {"totalCount": 240, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "THE CRITICS ARE WRONG ON THIS ONE\nLike Life\n\nThis movie is a funny…brutal and heartbreaking film, anchored with fantastic and emotionally devastating performances by Florence Pugh and Morgan Freeman, that forces us to confront our grief our fate our mistakes and the consequences of those mistakes  but also leaves you with an offer of hope. Bring tissues"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I came in expecting great performances from Morgan Freeman and Florence Pugh and I was not disappointed. Zach Braff's script hit home for me having been around addiction my whole life, he got the nuances correct even with throwing in the trope of rummaging under the sink for old pill bottles (it's a trope for a reason) and the hidden bottle of whiskey in the china cabinet (my dad hid vodka). It can be a bit triggering if you grew up in that world - hence Braff getting the script right. Molly Shannon was perfect on pushing the buttons of all enablers who think they are helping, and played the part teetering on the truth edge of annoying. But the love within and throughout the movie drives the story. Well done to the amazing cast. Well done Zach. I'll be watching this again!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Halfway thru this movie I stopped and looked at my daughter and said wow the acting in this movie is amazing I loved how the movie wasn't predictable great story great emotion"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is the most beautiful movie about someone surviving a tragic event, struggling to fight through the pain, and ultimately trying to become a better person because of it. Its a must see."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "So realistic.  It felt like you were part of the main character. Zach Braff did a phenomenal job at producing this very well made film about love, tragedy, addiction , heartbreak and forgiveness."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "It was a great movie, I loved every minute of it. Lots of good with a little dysfunction and a whole lot of forgiveness, highly recommend!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It was an absolutely gripping and heartbreaking movie. Some of the scenarios may not really happen in life but it was well executed and the acting was incredible by all."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Such a beautiful movie. Beautifully moving and written so well. Cried my eyes out. 10/10 definitely recommend."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The touch of humanism thats needed in todays world. Loved it!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Ignore the critics (they tend to be overly in love with themselves). The movie was a smidge contrived but really good, Interesting and well done. I even cried a little (more than a little). Florence is outstanding (although she could do a Burger King commercial and her performance would be Oscar worthy). Again...ignore the critics."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "this was inspirational and beautiful"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "\"A Good Person\" is a good movie. Florence Pugh has come a long way from \"Fighting with My Family\". This is one of the best performances I've seen her do. She even manages to steal the scenes acting opposite of Morgan Freeman. If you get a chance I recommend seeing this movie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is one of the best movies I've seen in years. Thank you for depicting recovery and the grieving process in a real way. I can't wait to see it again."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "It was very human and real"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Loved it. As usual, Morgan Freeman was amazing! The young lady that was a singer performed greate also"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Please see this movie!! It’s beautiful and well written and I hope Florence Pugh is remembered at Oscar time!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Florence was just amazing in every way! This movie should be a must see for everyone."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "A little too much of Florence Pugh in this film, she’s almost in every frame. Obviously the director was obsessed. Unfortunately we miss out on learning more about her mom, Molly Shannon and friend, Morgan Freeman who’s characters did not get the time to be developed more."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "acting, directing, storytelling, music"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Fantastic! Emotional! Great movie’"}]}}, "emsId": "e57b77db-b166-41f4-88b7-48601fd7cffe", "emsVersionId": "94b4939f-7802-4784-904b-eb32314e97ea", "movie_name": "A Good Person"}