{"data": {"audienceReviews": {"totalCount": null, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "I only watched this movie because they filmed at the university of Redlands which I just recently graduated from. It was fun seeing all the school buildings and campus I once walked through. The movie overall was not great. Script bad, plot bad. At times humorous"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "A fun, escapist romp, if you're looking for light hearted diversion. Or if you've ever wondered where the mysterious JD Salinger might have felt safe enough to make an appearance! Some small out of the way college maybe?"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "I don't understand some of the reviews for this film. It strikes me as more of a European than an American film, something beyond logic, definitely NOT a rom-com.  I can see that it was marketed that way, but there's no evidence for intention. Really solid performances from Michael Shannon, Kate Hudson, Don Johnson, Jimmi Simpson and the rest of the supporting cast. I was hooked from the first frame."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I really enjoyed the movie! What a great cast! The setting and locations used in the movie were outstanding and I loved the scenes that displayed the beautiful University of Redlands campus and other locations in Redlands! I saw the movie in a theater and look forward to seeing it again on tv!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is a beautifully poignant and comedic tale about insecurity, representation, and trust, a trust we must have in each other as writers, humans, and more importantly, a trust we must learn to have for ourselves."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is a charming movie.  Funny and poignant.  Michael Shannon and Kate Hudson are really sweet together.  And the plot is a clever rumination about celebrity and the literary world today.  Don Johnson is very good too!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "This small, intimate movie is going to play way better streaming on one's home screen than in a theater. It's a film of moments, small kernels of craft from a good, talented cast, meant to be savored from the pillowed cushions of one's own couch.\n\nMichael Shannon as the main character Shriver, provides a perfect example when he's asked to read aloud from GOAT, the masterpiece he's pretending to have written, by Kate Hudson's character, Prof. Simone Cleary. Trapped, he haltingly begins, but as the text's scansion sinks in, he shifts from a halting undifferentiated reading to one filled with meaning and rhythm, as if he's finally accessed his real self. \n\nThat's what good, small movies do. They offer the intimacy of craft usually lost in the bluster of bigger films."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "A wonderfully written and directed movie with an amazing performance from Michael Shannon. A funny, meaningful must-watch!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This was a really fun and clever watch-- very literary and quirky. Shannon delivered, also loved Kate Hudson in it. The story kept me guessing until the end, + some good laughs. Worth the watch!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "Terrible soundtrack. Shows how poor the story delivery is.\nWhy are so many comedies not natural in what people would really do. \nMovies are getting so processed now. This is one of them that totally misses the point."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is a quiet, humorous movie with a good bit of pathos that takes us into the world of academic nutballs at a literary conference, where the longings and missed opportunities portrayed are sometimes very close to home. The actors are perfect. It's cathartic to be on this bittersweet romp with them."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "I loved this film, though some of the comedy had a bit of an inside-joke feel to it. Still, the world of literary ambition (or any ambition) came across. The humor is more droll than bust-a-gut funny, which I like. Kate Hudson is just incredible in it. The best thing I've seen her do, perhaps it was going toe-to-to with the great Michael Shannon. Or maybe the directing. It doesn't matter. The supporting cast was perfect. Da'Vine Joy Randolph was funny and perfect.  I loved the young woman who played the hotel clerk. Her facial expressions along were priceless. And the scene where Shannon as Shriver seduces Kate Hudson's Simone with literature was my favorite moment in the movie. Yes, Michael Shannon can just read something and steal the show."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I enjoyed the movie for its humor and story line. I will be seeing the movie again.😉"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "As Shriver appears to be a handyman masquerading as an author, this is an art film masquerading as a rom-com. As Shriver morphs into a writer this film becomes a subversive take on the genre of mistaken identity comedies. The whole thing unwinds at the end with Shakespearean brilliance."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Funny, romantic, and featuring great performances by Kate Hudson, Michael Shannon, and others, this is a terrific evening at the theatre. Though it's only director and screenwriter Michael Maren's second movie, and production was reportedly plagued by health issues and the Covid pandemic, Maren scores where so many veteran filmmakers have failed this year with their bloated, pretentious productions. The good humor of this fable means that some of its more pointed digs land before you quite realize it, but that makes it all the better."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I thought it was very funny and engaging. I loved the story line and the cast was wonderful. It didn't drag at all. I highly recommend it"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Full disclosure I went to grad school with the book's author Chris Belden. I read his manuscript \"Shriver\" there and loved it. Having his book brought to life with Kate Hudson as lead was truly amazing. Especially cool was the way the movie director put author Chris in a cameo as a guitar-playing Shriver fan. Michael Shannon did a great job as Shriver and I've been a fan of Zach Braff since Scrubs and Don Johnson since Miami Vice, so A+ on the casting. If you're looking for intelligent drama, romance, dashes of comedy, and a twist ending, this is it. If you want an overdose of CGI, 3-D, or lots of things blowing up, this movie won't be for you. Was happy to see this movie on day 2 of its release. Cheers!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "I loved it... Throughout provoking and entertaining, A Little White Lie explores reality (fact) vs imagination (fiction) and how we all evaluate or ignore the ingrained imposter syndrome that confronts us all at one moment or another. Great directing by Michael Maren beings the characters to life and Kate Hudson and Michael Shannon have a subtle yet yearning chemistry. Don't miss this movie!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "amazing performances, clever writing, funnier than expected."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Loved it. Smart, funny, and Shannon leads a great cast."}]}}, "emsId": "60fa571c-eb93-344b-9dd4-6c42620bf6ae", "emsVersionId": "4313b103-c81b-391a-8004-ee6519acc3e1", "movie_name": "A Little White Lie"}