{"data": {"audienceReviews": {"totalCount": 85, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "One of the best specials on Netflix. Santino delivers"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "I cannot figure out the target audience… it's just not funny. Unoriginal jokes with poor delivery. Dude just comes off super unlikable."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Killer. So tight. So fresh. Best cheeseburger I've had all year."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Sharp and clean.  An extremely well-crafted special.  Incredibly funny throughout but heartfelt and poignant at just the right moments."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Andrew Santino tried his best impression of Bill Burr and failed miserably."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Completely hack. COVID, wow, what a great topic. That dead horse has been beaten so much it's turned into a fine mist. Politics, you know a true hack when they have to rely on outdated political jokes that just aren't good in the first place. You never hear anyone say \"Remember that great joke (legendary comedians name here) said about (president of that time)?\" Because great comedians don't do hacky political comedy that will never stand the test of time."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Unoriginal and the closing joke was just a bad shane gillis ripoff.\nAwesome podcaster, bad standup."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "I wanted to love it, but I didn't find much that was funny.  I love stand up, but this was disappointing"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Andrew Santino manages to bring the bad friend style of comedy out in full form, capturing the same quirky , fun, irreverent style that makes the podcast so good. Well done Santino."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Every topic was safe, this show was absolutely filtered and he skewers nothing. I'm ashamed I pushed play. He picked the safest topics possible and it was unoriginal, bland and very very safe comedy. Typical scared comedian protocol."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Hilarious! Santino is the best"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Terrible  :/\nAlot of cringie parts aswel"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Santino is so genuinely funny. Some comedians are good joke-wrighters, some are storytellers, some are entertainers. Andrew is a good mix of all, but mostly he is just a funny person.  Of course comedy is subjective, and everything is not for everyone - but for me this was great."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Despite being a fan of Santino for a long time through both of his podcasts, I found this special to be a little lackluster. I think it's appropriate that it's called cheeseburger; it fills you up and is simple and tasty, but it's not a steak dinner. The first 15 minutes are rough and repetitive, with classic covid jokes, but it picks up and becomes quite enjoyable after that."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "As a podcast fan, I've seen other comedian podcasters comedy specials after only hearing them on podcasts and I have been disappointed in the past. Andrew is as witty and insightful on stage as he is on a podcast. Excellent special."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "amazing. santino is one of the greats."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Awful. Why Netflix thought I, or anyone would want this, is beyond me."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Excellent take on the state of the world right now! The cheeseburger analogy gave me chills! Love his centerist political views. Can't wait until Andrew puts out a 2nd special!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Just Not Particularly Funny.  am not very familiar with Andrew Santino, or his work. He appears to be a charming, decent guy. The issue is that he is just not that funny. It is not that he is offensive, or too esoteric. He covers a variety of topics, from the pandemic to sexuality to growing up in the 80's. His delivery is natural. His jokes and storytelling might be ok if he was a friend of yours, but not enough to conquer a Live audience. One of the other issues with the special is that he is also the Director and it is not shot very well. The special keeps going back and forth between two camera angles and it it a little distracting. I like Netflix comedy and try them all. This was very average, at best."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Absolutely one of my favorite hours! Andrew Santino is awesome!"}]}}, "emsId": "aac2cbea-d961-484c-81dd-5dd6dc5274a8", "emsVersionId": "25aa5295-9cb2-492f-a085-fae05e369f30", "movie_name": "Andrew Santino: Cheeseburger"}