{"data": {"audienceReviews": {"totalCount": 43923, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "It is a beautiful movie. The colors are beautiful and the 3D is worth your money. The scènes are beautiful. Action keeps you gripped. However it could be done in 30 minutes less. And towards the ending you feel it is a set up for a sequel. That makes the end little less satisfying. Hence the 4 stars."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "this is why many of us go to the movies.  It took a large team of humans a lot of work to make this, and it delivers the goods.... excellent entertainment!  You may want to avoid if you don't like guns, explosions, or killing in your cinema.  The acting, camera work, 3d effects were in a good pocket, the camera, graphics, and score are excellent... nice to return to Pandora once again!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Wanted to enjoy this but it's just so generic in its storytelling that I completely lost interest."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The movie is directed by James Cameron and was release the 14 december 2022 ( in french ) the mains caractere are lo'ak and his brother whereas their parent were the mains caractere in the fisrt movie. The 2 brothers were the son of James sully, the boss of the population. The movie is incredible, at the end I don't have worlds to discribe what I saw, actors are so good, spectacular with the stage kn the water when they learned to drive the animal. Avatar is a fantastique movie with spécial effect with splendid background, nature, in the cloud, in the water, When I saw that I want to be with their. The photography is really incredible and submersion, all are very good. The movie gives lots of emotions, empathy, happy, surprise by the level of the movie. Generraly I don't like movies but I think it was a good idea ton see this movie and I'm not disappointed. The very long shot were insane, it's the best movie that I never see, the story is good, the caractere were outstanding and lovable. And I don't forget the song which give the rhytm and add more emotion that we have with the picture, I will never forget this movie, it's the best for me. I recommend this movie to anyone who loves emotional and action scene with incredible background and long shoot, go now to see it if you haven't see this movie"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The movie is directed by James Cameron and is the sequel of Avatar 1. The action take place in Pandora several years after the first story Avatar 1. Jake Sully (Sam Worthington) and Neytiri (Zoe Saldana) have a kids. The plot is amazing, we follow their kids, their adventure and their thearts: Miles Quaritch (Stephen Lang).\nThe special effects are outstanding because we are really this feeling that we are in the water with them and the animals are incredible. The acting is powerful we attached with the characters. The script is really really good because we travel, we have emotions. Generaly, I find this film absolutely AMAZING!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Amazing graphics, nice story line lots of action."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Avatar the way of water is the biggest movie and James Cameron continue the dynamic of the first movie and called the principal actor:Sam Washington Zoe Saldana and Stephen Lang and the special effect to gube movie the aspect futurist.resumate:The Avatar way of water it's a story of Jake family escape the home and people and join the people of the water Metkayina and to apply the coutume of people but  the son of Jake Lo'ak it s a friend of creature of the sea but colonel Quartich come back for killed Jake and his family buts the Jake family it's unite"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "never watched it, i love being a hater. indigenous ppl just want their land back wtf is this supposed to do?"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "The first Avatar movie was a great adventure movie. This one they turned into a weak action movie. Very disappointing."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Si tengo que decir como definir esta película sería en una simple palabra \"innecesaria\" por que es lo que es lo que podría rescatar serían su fotografía, efectos y escenografía pero eso es lo único"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Fantastic, a must watch if you liked the first one!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "I though this movie has better character development than the first film,that's the only think better. Still pretty good though."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "My husband loved it!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "The effects were nice, but other than that it was basically a horrible II, like most II ruins the magic of the first movie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "3D! So disappointed that 3D movies have fell so far out of popularity.The Movie itself was surprisingly just as good at the first Avatar movie, and the animation was spectacular!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Have to watch in 3D. Very visual."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "An excellent film, you can put it as a standard and a classic for a long time. But it is a pity that it is better to watch it in this version only in cinemas, otherwise the effects will not be the same."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "From story to visual effects, everything was remarkable!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Another fantastic movie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Overall great movie. Great story line, amazing effects in 3-D. Very sad though. I struggled with how sad it was."}]}}, "emsId": "6fbed893-5b71-3dc2-b35d-68ee630f6828", "emsVersionId": "463a3f6d-e646-3e0b-9010-f0ce3ba484d9", "movie_name": "Avatar: The Way of Water"}