{"data": {"audienceReviews": {"totalCount": 131, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It was amazing, but for being a movie about a rock concert, the audio quality was awful! This was a theater I go to often and I've seen many amazing action movies with incredible sound, so I expected to be blown away by this concert. I was told by management that they did all they could to turn up the volume and improve the sound, but that is how it was filmed and created. I guess they didn't create the footage with Dolby surround sound in mind, which is very unfortunate. Otherwise, the video footage was awesome, as was Billie's performance, of course!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Absolutely amazing! Definitely gave the authentic concert feel!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "So amazing! If you missed out I am so sorry for your loss but it was absolutely incredible! Just like being at the concert!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It's spectacular! Congratulations, Billie Eilish! This was one of the most beautiful events I've ever seen in my life. He sang his incredible songs perfectly, with the fantastic combination of instruments on the part of Finneas and Andrew Marshall (Billie also at a specific moment), an incredible edition and a perfect audio capture. One of the best concert films I've ever seen, extremely flawless."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "it was really amazing, even if I'm old, I cried in some parts of the film very touching show. Especially in Everything I Wanted, Getting older and When the party's over.. her energy to entertain all those people by herself, the composition that she and her brother created especially for allowing the question (artist) and answer (fans) when she's on stage, amazing,  her stage presence, her smile, when she talks to fans, the love and passion she has is really contagious. She conveys authentic love and she enjoys herself with her fans in a naturally way with her music on that stage. She has fun with fans, she has a connection I haven't seen in a long time.  Pure authentic connection and show.  Less bullshit and more real music, emotions and fun.  She is one with the audience. What i noticed is she took the hip hop performance and incorporated it into the pop performance inserting alternative pop into the compositions.. an innovation in pop performance, never seen a pop performance like this… very slow music too which turned into disco dances.  Incredible.  It was very nice to see from such a young girl, creating by herself such a different show from the usual pop that Madonna created with dancers Etc and that Britney had then popularized it in the past.. Billie who with her original ideas, created her own rules in pop, everything from music, music videos to shows, really cool.  If there were more artists like her trying to create something different and if they were brave enough to take a chance and do something different and personal, we would have more fun and different shows to see instead of more than 10 years the pop shows all the same.  Thanks Billie, you are special, your souls is full of love and empathy, you are the Queen of your generation and im happy to see this generation is better than ours.  Never give up and never lose that light in your eyes that makes you special and distinguishes you from anyone else.  On that stage you are a rockstar! ⭐️ Keep spreading love and empathy, this world needs more people like you! xo"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It so good I love it"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Amazing show! It will be interesting what the future holds for her and her brother."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "simply sensational, loved the energy, loved every moment and had a lot of fun!!!! I want a solo show in Dona Billie, anyway, I loved everything and I don't even have words to describe everything I felt."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "I thought is going to show a backstage moments but was just a regular concert"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "LOVED THE ENGERGY AND THE VIEW"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I loved the experience of a concert at the movies. It was so good to watch and sing!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "IT WAS SO MUCH FUN!!!! Everyone got up and went to the front to jump around, sing and cry together."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Great concert film and a fun celebration of this era for Billie! loved getting to relive it on the big screen."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It was great took my teenagers for a late Christmas present who are huge fans of Billie Eilish. I would buy it if it was released on blu ray"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Not sure why there was two random Billie Eilish music videos at the beginning but overall it was a cool experience. My daughter loved it!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Amazing, energy was giving cute as hell"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Unfortunately you can’t see it again now but what a fun experience. I’ve seen her live twice but seeing it on the big screen again was almost just as fun. What was even funnier were the kids at the bottom of the screen jumping and singing together. Did not expect it and had to join them on the song Oxytocin. So much fun!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I really want to give this like 2.5 stars because my experience started terribly. The visuals and cinematography of the concert was excellent, but the audio levels of the music in the film was severely lacking, not sure if it was due to the audio mixing itself in the film OR because the the theater itself didn't bother to properly set it up. It was put in like a throwaway theater room with the oldest technology only a few of the speakers worked. The best sounding thing from the concert film was the audience.\n\nNext, it did NOT help at ALL that the two young women behind me SANG their hearts out an drowned out ANY vocals I tried to listen to and enjoy from Billie's performance. Of course I didn't say anything because who am I to destroy their memories. Later on in the film, it did get pretty interesting. A bunch of the people in attendance got up and went to the front of the theater as if they were at the concert, center stage. They started jumping and singing and dancing together...that's when the movie became something else. IT was very nice to see them all enjoying themselves. Singing in unison, reacting to the concert as if they were there. Gave me goosebumps. By the end of the concert when \"Happier Than Ever\" was on, I had a tear in my eye. Really felt like I was there. I'm sure I'll get another shot to watch the film again, but I'm glad I was able to witness this beautiful moment between strangers on this day."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "I didn’t like the volume it was low 😒😓"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "OMGGGG. I have never seen anything as perfect as it. It's a magical experience that I could see all of fans and enjoy the \"BEST MOMENT OF MY LIFE\". We know that Billie won everything with this, our heart are perfect again. I have been learning more about, how peoples can live without Billie's songs???? I DON'T KNOW, ITS LIKE BREATHE TO ME."}]}}, "emsId": "cf404838-43b2-3a95-b900-cd30c06eda22", "emsVersionId": "86192a3a-c08f-3302-8a09-fe220d29a360", "movie_name": "Billie Eilish: Live At The O2"}