{"data": {"audienceReviews": {"totalCount": 73, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Wow this came from absolutely nowhere. I adored this movie. It's a shame because it seems like this going under everyone's radar. Disney decided to release this directly to streaming and gave this little to no marketing. So I don't expect many people to watch this. If you're reading this, please go and give this a watch. If you're a fan of sports and are in middle school, high school, or even college. I think you'll have a fantastic time watching this movie. The characters are all fantastic, especially Chang. His character development from beginning to end is drastic and written incredibly well. From a low budget Disney movie, you wouldn't expect good acting but this had that. There was some pretty solid performances. The soundtrack is also great and features some very good songs. This movie is loaded with themes and dives into plot lines I never would've thought they would touch upon. Now onto the negatives. There honestly aren't too many negatives. If I had to pick some out, I would go with the pacing around half way through the movie. After what seems to be the climax of the story ends, the plot continues and for a moment it feels very dragged out. It isn't a major issue because after that feeling of it dragging out, the movie sucks you back in with an even better plot that is a great character study of Chang. Lastly, the final criticism I have is that it switches from cliche to serious very often that it sometimes doesn't really know what vibe it wants. The Fabelmans does that perfectly whereas this struggles. Once again, not really a jarring flaw. Just a few things I nitpicked. Overall, this will go down as one of the most underrated movies of 2023 and I think everyone should check this out on Disney+. Fantastic story. I'm very happy I was able to watch this."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I didn't expect the mother-son relationship to be the emotional center of the movie.  But it is, and that's ultimately what makes this an ultra-authentic Asian-American movie.  \n\nIf you are wondering why his name is Chang, keep your eyes peeled for the scene where the kids chant his name and then one of the adults uses his other name.  Fantastic inside joke that is really easy to miss!  \n\nAsian-American stories have usually disappointed me, I kept waiting for the mis-step.  But there wasn't one.  \n\nThis movie is also somehow very old-school and super modern all at the same time.  Loved it!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "4 1/2 stars because they played I am the best by 2NE1. Love me some 2NE1"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "The trendy angle of 'the woman's perspective' works well here since its organic to the story, however, the characters often go into cliche whilst dealing with this case.\nI did enjoy the mood, the eery art direction and watching the two leads battle with uncooperative males, but we've seen it all before.\nOnly minor lip service is given to Loretta's marriage difficulties while she spends so much time away from the family.\nA MORE INTERESTING FILM WOULD'VE INCLUDED Loretta's life sort of unraveling, or at least the toll it ook on her while she investigates this case. As of now, her unconventional life of investigation while having a family has her barely breaking a sweat."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "If you were to sit down prior to watching this show with a pen and piece of paper and write out the plot points ahead of time, you'd probably be 99% correct. You know exactly how the story will unfold. It's watchable, if only barely. \n\nThe main character is the same ordinary, self-absorbed shitty teenager you see in nearly every teen movie or tv show—he's so formulaic and unlikable it's almost laughable."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "this movie is perfect"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "What I Loved:\n1) Asian-American representation that isn't the typical Straight-A, Model Minority Myth depiction. \n2) Story was emotionally captivating (I cried a few times), but also hilarious!\n3) Made basketball and dunking interesting to someone like me, a non-sports fan. \n4) Realistic, relatable characters. I was rooting for every single character. \n5) Coming-of-age film. \n\nWhat I Wished (SPOILERS AHEAD):\n1) Touched more on why Chang's father left the family.\n2) Touched more on Matt's WASP family and upbringing."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "Chang has no dad in the picture and his high hopes of becoming more popular aren't coming true. So, he trains to be able to dunk for a bet and films it all. The training is legit, but the day of the test he cheats. It's a worthwhile family film with some morals."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Sometimes we all need a good, light hearted movie to watch and this movie delivers that. It didn't go the way I expected and this was a good thing."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "Ultimately, the film is OK, it's very cheesy and very corny, but what do you expect from Disney original movies? They all are like that \n\nThe plot is all over the place and the final outcome of everything is all over the place. It's more of a movie to play while you're trying to clean your house. It's not something that I would ever revisit or ever even consider to revisit, it was OK, but I was very bored to the point. I think I fell asleep."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "It was decent, but not awesome"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It is an inspirational coming of age story. Reminding us to be brave to pursue our dreams and stand up for ourselves. Highly recommended."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "It was ok but the conflict was never fully resolved and it portrayed him as if it was ok to cheat."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It wasn't some cookie cutter high school story as expected, but of course, that's a great thing. Enjoyed it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "great movie to watch with the family."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I was not ready for this emotional rollercoaster. Gorgeous cinematography and sound design paired with strong performances all-around."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Enjoyable, good Friday night family movie. Nice editing."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie was really fun. I loved all the fun uses of social media and cheeky visuals and all the actors were really strong, especially the lead and his coach. I was impressed with the bold directorial choices and the relationships they explored. So delightful"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Great director, great movie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It's a lighthearted story from the perspective of an underdog basketball fan not quite sure of his place in high school dynamics and the game"}]}}, "emsId": "204fa220-4b0a-4cc2-8c15-f375c2d84ba0", "emsVersionId": "ab930ca2-6768-4fbb-880e-57b0eeea7718", "movie_name": "Chang Can Dunk"}