{"data": {"audienceReviews": {"totalCount": 1201, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "It's not a must see, but it is a cameo fiasco and really funny"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "Was okay actually. The original series is worth the watch so check it out. The rescue rangers haha"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Originally I thought it was going to be another one of Disney's cashgrabs, but I was so wrong. It was a fun movie made by some people who are actually passionate and creative. I'd recommend this movie to anyone. Why didn't they release this in theaters?!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "An unexpected hit!! Really wish it was in theaters and not on Disney+ only"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Ohhhh my god…\n\nDisney's new #ChipNDale: #RescueRangers movie on #DisneyPlus from The Lonely Island, thanks to its blend of humor, story, mystery, not-overdone nostalgia, and cast (including John Mulaney & Andy Samberg as the iconic duo), is a real flippin fun 90 minute blast.\n\nThis is what Space Jam 2 should've been, but wasn't cuz it didn't have what this movie had, clever ways of establishing balance of story and nostalgia without overdoing it, akin to the formula that made #WhoFramedRogerRabbit work, yet also expands on that formula with some added commentary on the way Hollywood views animation and animation styles these days in ways that are both clever, hilarious, and shocking, which is why it makes me sad this movie wasn't a theatrical release.\n\nAlso, two cameos in the movie made me laugh and made me go \"oh they did this Disney character dirty,\" but not in a bad way, though how they handled Peter Pan (not the second of the two cameos I'm talking about) in this movie might be controversial, even if it wasn't intentional, due to some backstory regarding the real-life actor who voiced him in the 50's.\n\nI definitely wanna see it again and I plan to. And I'll watch it with people close to me next time.\n\nFinal rating: 5/5, though I might be more biased towards it since this is the one Disney+ movie and streaming service movie that I've been most looking forward to and wanna see succeed. ⭐️⭐️⭐️⭐️⭐️\n\nP.S. There is one mid-credits scene to stay for as it sets up the future of where this character goes next."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Everything about this movie is amazing!! Love the references!! And the cameo's!! Love the casts! Hope we got more stuff like this!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "I think this movie is pretty good, the animation is so diferent, but is one good innovation! So 4 stars!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Best Cameo ever, and it good to bring back Chip n Dale Rescue Ranger but Cameos from other cartoon movie and tv series I hope it can continue of Cameos."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "Growing up on the series, it didn't fully embody the spirit the original and felt vaguely familiar, but it wasn't as awful as I had feared. Unfortunately it missed a lot of opportunities to the bring the characters back to life as well and lacked the spark of whimsical adventure. Maybe the Disney Channel days of my youth are lost on the younger generation."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie has the magical touch that it gives it, and it is that the cameos from other movies and series that are from Disney or not, are the best that can be seen, and its voice actors are great for all those who saw it, it is this film is undoubtedly one of the best Disney has made in years."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "A terrible movie who's only savior is it's references to other movies."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "I expected it to suck in my opinion but it broke my expectations and turned out to be cool"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Doesn't quite reach the greatness I was hoping for, but it's still loads of fun, and I appreciate how much Disney let the team get away with in taking potshots with the culture commentary, as well as the endless stream of references. It's a fun throwback in the guise of a buddy crime caper, that parents can use to introduce their kids to what they grew up with."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "A great spoof on animation and Hollywoods obsession With reboots an exciting and you don't have to be a kid to enjoy this Hallmark of 2022 8/10"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Chip y dale al rescate  Es una divertida y agradable película que cuenta con un villano improbable pero interesante que se ve como una amenaza que tiene potencial si sacan una secuela , la película es una mezcla de nostalgia con película de crimen muy bien desarrollada , tienes muy buenos cameos que no opacan la pelicula , la animacion esta muy bien acoplada y los personajes siguen siendo muy entrañables, yo fui muy fan del show en mi infancia y le tenia muchas ganas a esta película y debo decir que me encanto es lo que esperaba risas y nosalgia c:7.9/10"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "alot of cameos and the jokes were very funny"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": " It was nice to get something like Roger Rabbit again. Though fans of the show may be disappointed that it isn’t just an adaptation of the show."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Two words \"Nostalgia bomb\""}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Overall, I'd call Rescue Rangers a fun jab at the roller coaster of both Hollywood & cartoon history. It was jammed full of great references & eye winks to fans of multiple franchises. And it was a generally decent adventure."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "New Disney+ film and I do not know exactly what to make of it. I mean, who exactly is this film for? This is a film taking a lot of ques from Roger Rabbit right down to the neo-nior kind of of vibe. Also like Roger Rabbit it has some surprising adult content in the show.. like their version of being dipped, bootlegging leading toons to be forced into low rent knock off movies. There are porn jokes, Monterey Jack is a crack addict.. I mean cheese addict... it is just strange. They have taken a 89 cartoon and tried to make it appeal to the people that used to watch it who would probably all be in their late 30s, early 40s. So the tone of this is all over the place. It is not dark enough to be another Chocolate Bunnies of the Apocalypse, but it is not exactly for kids, but I think kids could probably watch it without really getting it.\n\nIt is just a odd movies and not unique. Disney+ has a number of old school cartoons coming out soon as films on stream, but aimed at adults. Phineas and Ferb a 2007 cartoon is supposedly getting the same treatment. We got the Rocko's modern Life one a while back and they did it with Invader Zim, but that should have been way darker. He-Man on netflix, though a utter disaster was the same kind of this, as was Voltron. I think we are now in a time where the corporations have realised that media whores are now old and many still watch the same cartoons they did as a kid. There is defiantly a market for shows based on these famous ips that are actually sorta made for the adults, not a new generation of kids. The idea of making one of these IPs but NOT making it a family thing, but marketing it directly to the fans of the original.\n\nVerdict : I'm not sure if this movie is good or not, to be honest I just got it out of curiosity and flicked through it... but I do think WHAT this film is, is actually pretty interesting. Wonder if I'll get a dark and gritty spaghetti western style version of Lucky Luke or a brutally realistic spy thriller with TinTin?"}]}}, "emsId": "7a2ab246-08aa-4650-bf35-6ad242f6f140", "emsVersionId": "7d598ef6-71a1-44cc-8d5d-3c832ca7c8ec", "movie_name": "Chip 'n' Dale: Rescue Rangers"}