{"data": {"audienceReviews": {"totalCount": 29, "nextOffset": -1, "hasNextPage": false, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "I love shlock movies like this, as long as the mix between good action and hammy dialogue is right. Himmler not dead and an Israeli spy is after him? Too good too miss."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "This wasn't just low budget, it was made on a shoestring. It was dire."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "This should win many awards, at the Razzies. This is by far the worst attempt at a war film, that I'm guessing, was also trying to be funny in a Inglourious Basterds kind of way, but not even a smirk was cracked - more like cringe moments. This felt more like a long, dragged out bad SNL sketch. The 102 min runtime felt endless with terrible pacing and long dragged out and mostly unnecessary scenes. At best, this should've been a short film. The story was just flaccid, lame, and boring. I've seen better cast performances in a high school drama class, but I'm sure most of the blame falls on writer and director Phil Blattenberger's inexperience on how to direct his cast properly. I'm not sure why this nonsense was even made. The bogus high reviews are more entertaining. It's a very generous 3/10 from me, being very forgiving for many rookie mistakes by a newb filmmaker. Blattenberger should've at least consulted a more experienced filmmaker for the many needed areas of improvement."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "acting sucked\n\nprettty \n\n- also script was bad"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Are you missing classic action films? Condor's Nest takes you on an action-packed thrill ride where the bad guys are clearly the BAD guys! After our good ole American unlikely hero watches his flight crew buddies gunned down by a particularly nasty Nazi (aren't they all?), we follow his quest for vengeance to South America where he meets some unlikely allies. It's unclear who to trust as the adventure unfurls. Al Pagano is clearly the stand out---his Albert Vogel is such an engaging character and he continues to surprise from the moment he enters to the end of the film. This is the well, let's go to Argentina and make 'em pay adventure revenge movie that makes the audience cheer for justice. Condor's Nest is an adventure worth the watch!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I think this was a surprisingly fun movie. Great storyline and I feel like this director is going places, as is the mostly unknown leading cast. I was totally invested in the storyline the whole time"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Poorly written, actors and acting was horrible, CGI/special effects was also bad. for example, in the beginning of the movie it shows a crew member sleep while taking flak from German guns, (BS) speaking from experience in combat, no one sleeps while engaging in combat. also, the plane gets shot down and the scene shows the crew on the ground near the wreckage and they all look super clean and ready for Sunday mass. That's just a few of many discrepancies I found on this movie. Not too much thought and work went into making this movie. here's a tip - if you decide to make a war movie why not hire veterans that have actually been in combat as advisors!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Fun action flick with a great cast!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Raw, gritty, low budget indie in the style of 50's post war films. Fun, punchy dialogue and good acting highlight this film with a plot that keeps moving and twisting all the way to the final scene. Great performances from actors you know and a few to you don't. That and an anti-hero who makes wrong decisions for the right reasons."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The performance by the actor named Al Pagano was fantastic"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "I saw this film in the theater and loved it. It has a very interesting premise and focuses on events after World War II with a portion that took place during the war. Most of the film is set in South America and features great scenery with some beautiful sets. Its like an adventure revenge film with lots of twists and turns that draws you in and keeps you on your toes. I am not a history buff, but I have read that some Nazi's fled to South America after they lost the war so I wonder if there is some truth behind the premise of the film. The film has great talent with solid acting featuring familiar faces and newcomers."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It was a great film. I enjoyed it from start to finish."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Fun action-thriller movie from beginning to end! Great acting throughout, beautifully shot. Will definitely be watching this a second time."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Has the ethos of an old western - fun and entertaining!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Great fun flick! Action and good acting. Sets are beautiful and the storyline, though a bit crazy and has some holes, is fun to follow and has some real revenge reward! Go see this one!"}]}}, "emsId": "fdb3160f-5d19-3cd4-a21f-2cc65093ce86", "emsVersionId": "53e4f6fc-546d-390b-b7f7-ec3582d829f8", "movie_name": "Condor's Nest"}