{"data": {"audienceReviews": {"totalCount": 43097, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "I'm my opinion this is way better than the first Doctor stranger , this would be a 10/10 movie but I hate what they did with the Illuminati. Practically killed them as soon as they were introduced. Poor John, i wanted him as Mr Fantastic ."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "With \"Doctor Strange in the Multiverse of Madness,\" Marvel Studios produced their first horror film. The (intentional) chaos reigns, which is probably only thanks to Sam Raimi's direction (almost) perfectly balanced, even if some characters were given too little space due to the mass of show values."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "aunque le haga falta mas importancia a dr strange en su propio filme realmente me encanto el estilo de sam raimi en esta película ,wanda totalmente brutal como villana ,dr strange realmente logra su subtrama sentimental pero lo unico q me molesta es que se haya tocado tan poco el multiverso auq lo tocado fue para mi brutal ,buena estética y ambientación y muy entretenida y intrigantemente  terrorífica"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "This movie is a movie that doesn’t focus on doctor strange, it focuses on the scarlet witch. I like the scarlet witch but this is a doctor strange movie. This movie doesn’t lead up to its name “multiverse of madness” the new character America Chavez had bad acting and overall the movie doesn’t have “Good” acting. "}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "This is the best film in phase 4 because sam raimi directs this mcu film like its a horror film while still having mcu style stuff in it, the special effects in this are great, the acting in this is great, this is a good mcu film."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "I watched this even after being told not to. This movie was a big upset to all of the haters who downsized it! Though they tried too hard to make America Chavez a funny teenage kid, sometimes to the point of making one cringe, Benedict Wong's dramatic portrayals definitely more than made up for it. Wong was no longer subject of comedic relief attempts and a joke here and there. Now, he is actually crucial to the plot and his dramatic portrayal, and his convincing performances were notable. Sam Raimi was great at keeping us on our feet. Especially, during the infamous Illuminati scene. A lot of great actors' cameos and references definitely add to the greatness factor of the film. I give it a solid 93%"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Shamefully incongruent with the larger MCU.  This Scarlett Witch may be true to the comics but this iteration of Wanda is completely removed from the character they've built in the MCU.  It is very clear that the people in charge of this movie didn't watch and do not care about the Wanda from Wandavision, because whoever this is, she isn't that same character.  If simply touching the Darkhold corrupts someone so completely to render them a different person altogether then they should have clarified that better.  A few awesome CGI scenes are not enough to redeem downright lazy storytelling.  I could elaborate but this movie simply doesn't deserve any more of my time."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "The beautiful performance of Elizabeth Olsen and Benedict Cumberbatch does not save this film that starts a mess and ends even worse.  A script that when it's not fanservice, it's a mediocre cliche!  an underutilization of talents in a messy story with a dull twist."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "Nothing special.  Should have called it Wanda"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "O nome do filme deveria ser Feiticeira Escarlate maluca da cabeça em UM outro universo. Doutor Estranho é um personagem secundário que foi completamente nerfado para dar \"superioridade\" a Wanda. Multiverso? Só se for daquela cena de 15 segundos do Stephen com a América Chavez viajando por vários universos. Em Vingadores: Guerra Infinita, Stephen enfrentou Thanos que possuía 4 joias do infinito (os itens mais absurdos e poderosos do universo) e aqui ficou com medo de uma bruxinha que leva duzentos anos para tentar roubar o poder da garota e faz fumacinha para sua \"Entrada triunfal\". Visão? Pietro? Que nada! A Wanda quer APENAS as crianças. Pelo menos é para salva-las de algo né? Só se for dela mesma. Sinto que o roteirista desse filme só assistiu a cena pós-créditos de Wandavision, um pouco de Loki e só. Espero que em Doutor Estranho 3, Stephen tome o lugar de protagonista novamente."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Great way better then the first dr strange and a lot better then most of the current movies/tv shows."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Great marvel movie. Can't wait for more multiverse!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "This was a movie where it didn't focus on Doctor Strange, it focuses on The scarlet witch. And makes Doctor strange seem very weak like he gets knocked out with one hit. The new character America Chavez had bad acting and overall the whole movie doesn't have good acting. But the good things are The scarlet witch, she was the big bad she was scary, cool, and way more! She Carrie's this movie. But you should go check it out!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Marvel What If...? Was way better in terms of storyline than this movie. It had potential but it was too busy making Strange and Scarlet Witch irrelevant to matter. I wanted to like this but it seems like this multiverse thing just makes everyone expendable. Not on board."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "This film is buried under a mountain of overused tropes and excessively dramatic action sequences that make it feel less believable than it predecessors. The plot doesn't ask, plead, or even beg us to care about an obnoxious teen with mysterious power they haven't learned to control yet (never seen that before, right?) Instead it tries to force us and we react with resentment. The attempt fails, and so the plot fails with it.\nOlsen's performance is decent but everyone else is either over-the-top campy or amateurish."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It was freakin AWESOME! It really felt like a Doctor Strange film, had so much magic and madness to it, had a lot of horror vibes, the acting, characters, camera work and visual effects were absolutely amazing. Liked it more than I did the first Doctor Strange movie and it definitely met expectations! 8/10 is my rating for Marvel Studios' Doctor Strange In The Multiverse of Madness."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Elizabeth olsen was amazing"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "This film had a huge potential of exploring the entire marvel multiverse and what does it decide to do? It decides to show just a minute long sequence of characters jumping universes all while entangled in a plot of another character who has completely forgotten the arc it received in the rpevious installments of the MCU. Yeah, there are a few surprises and cameos here and there but those too are short lived (and in my opinion, wasted). Could've been so much more but it just wants to be average. The fights, bgm and performances are cool which make it not boring to watch."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Una película que asombra con sus deslumbrantes efectos especiales y tiene un ambiente tétrico. Sam Raimi ha realizado una increíble película que en ciertos momentos se siente el aura de Evil Dead. Incluso esta película también tiene elementos y guiños que recuerdan a las obras de Lovecraft. Hasta el mismo titulo es una referencia a la novela \"En Las Montañas De La Locura\". La banda sonora de Danny Elfman es maravillosa dándole un buen ambiente al film. El guion es algo cuestionable que pude dejar dudas, pero cuando se trata del multiverso, no hay lugar para la lógica. Strange no llega a hacer mucho y es sorprendente que Wanda llegue a ser la antagonista por haber sido corrompida por el Darkhole el cual usa la gran debilidad de Wanda que es el deseo de tener una familia. Puede que no sea lo que algunos esperaban, pero sin duda esta película es otro gran inicio para explorar el multiverso y por eso la califico con un 10/10."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "The movie does not live up to its namesake, but the Illuminati is handled perfectly, Wanda as the villain works SUPER well. Again- overused CGI, and feels a touch underwhelming, but I like this movie."}]}}, "emsId": "783507b9-197a-3216-a5b3-99a00eb48cfa", "emsVersionId": "72ce456e-ac92-3903-a919-dcae399cf2ee", "movie_name": "Doctor Strange in the Multiverse of Madness"}