{"data": {"audienceReviews": {"totalCount": 12, "nextOffset": -1, "hasNextPage": false, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This film about a simple car journey to Texas is moving and beautiful. This coming-of-age story combined with a gorgeous bright and colourful aesthetic proves that this genre is very much still alive. The writing is witty, beautiful, and oh-so-crushing when it needs to be. The movie blends animation perfectly into the cinematography to convey emotions. It's heart warming and poignant. My favourite film of the last 12 months for sure."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Writer and director Sarah Kambe Holland's road trip movie is a pure delight. By mixing laugh-out-loud comedy with vibrant cinematography, animation, outstanding performances, and a discussion on cultural heritage, Egghead & Twinkie transcends simple labels to become something wonderfully fresh in the landscape of modern LGBTQIA+ cinema."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The most absolute best movie. I'm obsessed beyond words. The way this movie moved me is insane. I was in full blown tears because of how much i related to Twinkie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie was fun, imaginative, relatable and sweet! Rooting for Twinkie and heart breaking for Egghead, you get to ride along in this film to a great story of true friendship. Excellent performances: Louis Tomeo shows dynamic range and captures us with his pure heart and comedic skill. Sabrina is wonderful showing her conflict. The characters are so grounded and the story feels like we are right there with them."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie had me laughing, tearing up, and going through all the emotions. I loved seeing the best friend duo in action. Plus, all the animations adds a different layer to the film. It just hits all the right spots for me."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Amazing, creative film! You can tell how much work went into the finer details. Despite having a famously shoestring budget, the production value is insanely high and the editing work ties it beautifully together. The animation was seamlessly woven into the story and provided some fun laughs. All in all, a must watch!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "When I was growing up, I didn't have much in the way of media that represented girls like me. I usually would end up watching Disney Channel originals that included an entirely heterosexual cast that never even acknowledged that queerness was a thing. My partner donated $5 to this film back in 2020, and tonight we watched it together to see what $5 had bought us. I can confidently say that I would've paid double the price of a movie ticket just to have experienced this. I feel like a part of myself is healed having watched this, and this may be one of the best queer coming-of-age stories that actually feels like its target demographic is the center of the story, being LGBTQ+ teenagers. The characters are all complex and have dimensions to them, and it feels like it's ripped straight out of the few moments from my childhood that I could actually express my identity with my friends. It's chaotic, not planned, bombastic, somebody gets emotionally and/or physically hurt along the way, and it's something that you remember fondly for the rest of your life. If you read this, Ms Holland, know that if nothing else, you left a positive impact on my life that I will remember fondly. \n\n- Lia Krejci"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I've been following this movie since 2019 when it was posted on TikTok. I am so happy with the results. There was great representation of the coming out experience. I came out my senior year of high school and I related to this story on a deep level. This movie takes you on an exciting, fun and cute coming of age adventure. I experienced so many emotions during this movie including excitement, anger, nostalgia and I laughed a bunch.\n\nThere aren't many gen z movies that depict our diologue correctly. I had a great time watching this movie and will be watching it again in the future. Great job, I'm am so proud of everyone involved! <3."}]}}, "emsId": "2d44216b-6c5a-49f0-b625-089f5e50685d", "emsVersionId": "bca43b26-2c7c-4942-a7b5-77037f196abc", "movie_name": "Egghead & Twinkie"}