{"data": {"audienceReviews": {"totalCount": 17243, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "If this is the pinnacle of cinema I need to find another universe to live in."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "I found it impossible to understand the plot. After the first 15 minutes which were good I lost track of what was happening and it became just a long series of lung fu fights. Left before the movie was even over."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "It's a strange sloppy mess of a movie, certainly not worth being one of the most awarded movies in history, but worth seeing if you can tolerate the mixture of sci-fi and asian martial arts. There are a lot of laugh-out-loud moments, the acting is very, very good, the overall theme is interesting, and the staging and special effects are excellent. But, the plot is very confusing if you don't pay close attention, the big mcguffin turns out to be some sort of inside joke, and the ending is sappy. Still, I'm glad I went. Just seeing Jamie Lee Curtis as an attacking monster was worth it - scary and hilarious. But now I won't be able to see her hot scenes in True Lies without flashing on these newer images - which is kind of like the plot of this movie!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "One of the most 3rd class movie"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Confusing, weird, clever (subtitles needed otherwise you miss so much!!). Not sure why it won so many awards but still acted well."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "i also have adhd and mommy issues. dream blunt rotation with the writers in that room"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Really felt I needed to see this in a theater - so I did.\n\nIt  didn't disappoint - the characters had a great dynamic, and this visuals supported watching on a big screen.  The point it makes - that we have a deep need to feel seen and understood, somehow, and we'll take ANY how - is worth the watch, and the film does a great job in getting us there without seeming too heavy-handed.\n\nMy only criticism was that it ended abruptly - I could have surfed a bit longer on the \"All At Once\" theme."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "It was so bad, tiring to watch, overdoing effects and failing over and over in what seemed to be endless pointless absurdity. So many in the movie theater left before it ended. We literally endured it till the end, but I do not recommend anyone to spend any time and money on this."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "A near perfect movie that struggles with the slightest of pacing issues."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "More movies need to be like this. 100% original, a story which takes you in and gives you a ride like never before. Stands out and apart from the repacked BS Hollywood dishes out.\n\nLMFAO. Just read some of the other reviews. No, this story isn't \"confusing\", you're just apparently a huge idiot. Maybe if you don't understand the concept of the multiverse then, yes, you may be confused but the concept isn't that difficult to digest."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "My favorite movie of 2022."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "Strange movie, very disjointed.  Hard to follow, and only mildly funny.  Difficult to watch to the end.  How this won an Oscar is beyond logic."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "This is the worst move I have ever seen. What the heck is this move about?"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Terrific acting and Jamie Lee Curtis was delightful to watch, but the movie was redundant and tiresome (it might have gotten better towards the end, but I left after 90 minutes). I found myself looking around the theater to see who could sit through it. For me, this was a martial arts movie with a bunch of charming people who couldn't relate to each other. How did it end? I didn't care."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Best movie of 2022 so far, simple choise of choises awesome roteiro and awesome actors"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "A truly beautiful and amazing movie full of life lessons and meanings behind a creative journey!! I've watched this movie 8 times and still love it even more after each time!!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "Everything is happening all over the place, fantasy, reality and dream life. Too much to digest for me"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Loud, confusing and just not good.  Worst movie I have seen in some time."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Rarely does a title of a film exemplify both the on the screen action as well as the theme of the movie.  Everything, Everywhere, All at Once, certainly does.  What is going on during this movie?  Well…Everything…Where?  Everywhere…When…OK..  \nTouching on themes of existentialism, nihilism and family, Everything reminds audiences to soak in the little things in life even in the face of modernity, cynicism, and the increasing feeling that we are getting smaller and smaller in a world of constant technological advancement."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Confusing noisy story hard to follow"}]}}, "emsId": "c5a8fbaa-39aa-3caa-80a4-e94975665a8a", "emsVersionId": "d3e68343-dd00-30a3-a973-1234f5bacdc3", "movie_name": "Everything Everywhere All at Once"}