{"data": {"audienceReviews": {"totalCount": 57, "nextOffset": -1, "hasNextPage": false, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Jim is the best comedian alive! And he delivers another classic performance. Absolutely hilarious and man, the balls this man has to take shots like he does…it's great! Fearless comedy at its best. Will watch many many times"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "High n' Dry misses most of its marks, especially when Jim Jefferies decides to weigh in on trans issues in a way that might make a teenage boy laugh, but make most functioning adults cringe. The bits on either side of the nearly 15 minute trans rant are salvageable, some even approach the concept of comedy, but largely this felt like an \"edgy\" comic screaming into the void. \"They cut the dick off, then scoop out the innards with a spoon,\" is a paraphrased quote directly from the special. Unless children are his target audience, Jefferies should try to craft some jokes for adults next time."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Honestly the best comedy show I've seen, it's as raunchy as it can get and that's what makes true great comedy imo."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "Not his strongest special but Jim Jeffries is still going strong. His is, no doubt, great at his craft. For the first time in his career he looks healthy."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Jim Jefferies is still smashing it out of the ball park with his comedy! Glad to see him return."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "His obsession of eugenics in this special made himself special in multiple ways."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The best special from him yet."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Absolutely terrible compared to his other specials... I didn't laugh once, perhaps a little chuckle. I would be very p*ssed off if I went and paid for this show."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "Jim has some really good things happening in his life, good for him, but maybe not good for his comedy."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "It's still funny, it's just not pant wetting levels of funny, unlike his previous specials, which were far better."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "It's not for everybody. Funny enough, but could easy offend others."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "Some good, some bad. I don't get his attacks on Greta Thunberg. Turning that into a bit about killing newborns was simply bad taste. And that was the closer!\nI have liked his other shows so was eager to see this one, but was disappointed."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Hilarious , the man's done it again. \nAnyone down voting this is a hater. \nThe special is great. \nWell done ya c**t."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Jefferies is back - and it's good to see the new material.  He's always been funny, but the new material seems to come from a better place.  Still crude and outrageous - but that's the point."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Sux. His schtick is lame. It's alright to be crude if you're funny, he isn't. I don't know how people laugh at this, but hey..."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Really wasn't worth watching, think I laughed once."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "Not his best. No big laughter moments"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "It looks like the, possibly perceived, push towards politically correct comedy is officially dead with this special.  Jim Jeffries is back with this Netflix special filmed in Canada and it is very, very funny.   Jim has not changed one ounce of his vulgar, raucously funny and vitriolic humor.    His unique approach to talking about himself and the world through personal narrative and commentary on some of the modern lunacy we experience every day is great.   Jim's connection with his audience is magnetic.   His use of his language and his Australian accents, as well as his understanding of the image he has created, are all tools in his comedy arsenal.   I loved this special as much as I loved his prior ones, and that is a whole lot."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "This pains me to say this, but Jim you've lost your touch!\nI fell asleep.."}]}}, "emsId": "1d3614d3-0daa-4de4-9216-7f38188656d2", "emsVersionId": "1d3c2770-7d82-43ce-bb0a-efa8b41d2060", "movie_name": "Jim Jefferies: High n' Dry"}