{"data": {"audienceReviews": {"totalCount": 4116, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "One of his best! Suspenseful and kept me on the edge of my seat."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Silly story and premise that doesn't hold up to scrutiny, just like the bible. Some of the acting was decent, the writing and dialogue was awful."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "I found this movie to be EXCEPTIONAL, and a tremendous addition to the \"cabin in the woods\" horror cycle. Wonderful acting, and Shyamalan shows again that he still has \"it\" and can create an incredibly captivating film from start to finish. I highly recommend"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I thought this movie was awesome. It was intense and different but a great movie for sure!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Excellent movie. Although I kind of knew who the 4 individuals represented in the movie, the storyline was still intense. Great acting. Great cast."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "Another movie I was really looking forward to but wasn't that thrilled with. Can't really put my finger on it. Just felt like it was wrapped up neatly and and packaged to give the best ending possible. Looked up the original ending and it's exactly what the movie needed because without it it seems too paint by the numbers."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "O filme é instigante do início a quase o final. Imagina-se uma conclusão surpreendente, mas isso não é encontrado. Se o espectador quiser dar asas à sua imaginação e, com isso, superar a falha do filme, muito bem. Aqueles que desejam um enredo bem delineado do começo a fim certamente ficarão decepcionados."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Though it is light on action, Knock at the Cabin has a dread inducing tension running throughout the entire movie. Not knowing exactly what is going on is not a new thing for movies, especially M. Night movies, but this one is well done. I was kept intently invested as the whole thing unfolded."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "People's hate for the Bible will keep them from enjoying this great movie"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "The only thing that movies brings to the table is that Dave Bautista can take on serious roles. "}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "The reality that Shyamalan creates for his characters offers limited room for the viewer to have any reasonable doubt.  I think for this to be more of a thriller horror film, i would have preferred less justification from the characters actions, and more of an overall sense of delusion, and allow the film viewer to develop their own speculations. Overall the cinematography was very well done, with very close camera scenes, the characters in a way are intruding the viewer's personal space."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "The acting was fine but the pace and the story were horrible. I really don't know how M Knight's movies keep being funded. After 20 minutes I googled the ending and fast forwarded."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Very intense thriller. If you haven't read the book you had no idea of the outcome.  M.Night Shyamalan best film since Unbreakable."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Didn't read the book before I saw it, but now I know there are some significant differences. However, the movie was edge of your seat because you wanted to know wtf was happening."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Can not bring together family bonding and love with a horrible closure and ending.  Can not elaborate emotions and kept flat affect.  Completely disappointing ending."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Acting is alright but the camerawork and story are awful. The aggressive close-ups make you feel like the movie is literally being shoved down your throat."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "I've watched a lot of terrible M Night Shyamalan movies because they tend to be hit or miss, but this is a whole new level of terrible. It's just that the premise itself is so shockingly stupid. It doesn't have anywhere to go once the basic premise is revealed. And then… it's insulting that characters would actually respond in such contrived ways. It's not interesting nor suspenseful; just dumb."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Intriguing premise, tension filled but would have liked a Shyamalan twist at the end."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "I kept waiting for something that simply never came. It was interesting enough, but I did find myself somewhat bored and waiting for some great reveal… there wasn't. Worth a watch maybe I guess, but don't expect much."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I loved the movie and will watch it again. I love M. Night's uniqueness and creativity and messages."}]}}, "emsId": "ffdcfeea-d1ad-328f-bc08-f5a9434c454e", "emsVersionId": "63a7547d-5fc0-3f70-9d12-c6d01db45f80", "movie_name": "Knock at the Cabin"}