{"data": {"audienceReviews": {"totalCount": 773, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Thought it was very good!  Always look forward to Kevin Sorbo movies and this was no exception. Thought provoking. If you are looking for a brainless CGI Marvel shoot-em-up, this may not be the movie for you.  Well worth the watch."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Pre-ordered it because no theaters showed it in my area. We enjoyed it and can't wait the next installments. Thanks Kevin and all other cast. May God bless you"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Aside from the monetary system  truly being a singular currency  at some point soon..this movie 🍿this is \"Christian fiction\".\n please have the discernment and basic biblical knowledge  to separate fact from fiction.🙋🏻‍♀️\nI don't think this movie pointed people to Jesus Christ as Savior which should be the purpose of a Christian movie.\n The \"proof \"scenes really made me cringe😬 proof her mom was out of the casket? Ouch. The just shall live by faith. Not proof. That's science.\nLeaving a false teaching pastor behind to  witness and get them saved the few lost that stumble in 😆oh  irony. He don't  Know the truth \nthat's why he is left behind?  Come on ya'll. The Holy Spirit dwells in the believers and the believers are gone soo..who is saving after the rapture comes 👀??If the Holy Spur left with his peoples?\nThe only way this works is set dispensation theology aside and view this all happening while and before the catching away of \n1 Thessalonians  4. That's a movie plot \nSatan taking over while Christian's are still here thinking they should be gone \nScary 😧"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "I'm surprised because some faith and spirituality movies feel off somehow. This one felt well-paced, had a lot better acting than other movies, and it felt more real in its depictions of hate crimes, too. I really liked it! Hope to see more."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Please stop. I don’t know what else there is to say. "}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Great movie! Kevin Sorbo is brilliant."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "This was so terrible that after watching almost half the movie, I would rather shave my tongue with a broken beer bottle than finish it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "So bad I barely remember it"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Loved this movie and I hope that it awakens a lot of hearts to know that Jesus will be returning soon."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Kevin Sorbo did this movie justice,much better than the previous"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I recommend this to all Christians and new believers."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is really amazing as it follows the book almost to a point. I like the characters like Rayford Steele, Cameron \"Buck\" Williams, Chloe Steele, Nicolae Carpathia, Jonathan Stonagal, and even Pastor Bruce Barnes. I love how it showed how the world would react to the Rapture and how the world tries to downplay what really happened. I also love how they portray even the Antichrist by making people think that Stonagal is the Antichrist, but Nicolae Carpathia comes in a shocking way and kills Stonagal showing that Jonathan Stonagal wasn't the Man of lawlessness, but that Nicolae is. I also love that at the end Rayford, Barnes, Chloe, and Buck all run and hide when Buck shows that the Bible predicted all these end times events  and that people need to look and see that we need to seek Jesus Christ now for tomorrow may never come."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "The Truth will set you free, if you choose to believe."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Amazibgly Genuine Movie. Not fakeacting!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It was very good. I read the book and the movie was right on with the stieyline of the book!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It was according to the scriptures', I really it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Enjoyed the movie. Subject matter, acting, and production."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Reminds me how much Christ loves us and that we should always help others to know Him."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I loved this movie. I thought it was a wake up call to the entire world. It will move you.  It was very current. The message was clear and so believable how the government will spin the disappearance of so many in the blink of an eye. Stay for the end talks with Kevin Sorbo and Mike Huckabee!!!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Fantastic movie and I want all of my family and friends to see it!!!"}]}}, "emsId": "267b6cdf-ab15-3bde-8034-419f280f3d09", "emsVersionId": "073e0455-982f-3f56-a14b-c1d5c5e65091", "movie_name": "Left Behind: Rise of the Antichrist"}