{"data": {"audienceReviews": {"totalCount": 53, "nextOffset": -1, "hasNextPage": false, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Just watched the film. Animation at times is really smooth. Idk about the size of the team but according to some comments it was small, and I felt it. There are a lot of slow standing and talking shots. But man it's good when it hits its stride. 5/5 would watch again."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Less than a year after the release of 'Batman and Superman: Battle of the Super Sons' and 'Green Latern: Beware My Power', Josie Campbell rewrote the story of Kara Zor-EL/Supergirl (debut voice by Meg Donnelly) departing Krypton after Argon City was compromised earlier to join her cousin's Justice League as guardians of the earth.\n\nBrainiac 5 is Supergirl's interest in the 31st century's legionnaires training academy where most viewers would assume a development of her relationship with the charming team lead Mon El (just like the couple's affair in CW's 'Supergirl' Seasons 5–6) who gave her a first tour of the academy. Defeated by Supergirl's newly acquainted squad, the first sign of her bonding with other legions of superheroes at the academy, Mon El revealed his secretive service to a rebuilt prime version of Brainiac 5's first grand ancestor. Merged in deformed Brainiac 2–4 with an enhanced intelligence and will power, shockingly gruesome for an animation visual and voice effects, this grisly vice of the Dark Circle is a scene stealer albeit his modus operandi did not work out. The academy's vault was saved by the legions from redefining the universe by the deadly circle.\n\nJeff Wamester will return to direct part two of Kara's venture between unfinished business with her fellow legions in the 31st Century and lifesaving mission with her home team on Earth. Both tomorrowverse phasings give huge fans to watch their favorite superheroine back in action on television since the CW's live action series has been cancelled in 2021.\n\nEngineered by an all South Korean artistic team of DC Studios, subsidiary of Warner Bros. Animation and the new unit in charge of all onging DC Comics projects starting November 2022, this part one of Justice League's number one mighty caped girl is the latest instalment from co-production of DC ENTERTAINMENT before 'Batman: The Doom That Came To Gotham' arrives next weekend."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Great movie that explores the backstory of Supergirl and her relationship with the Legion of Superheroes. A definite must see."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "Animation and voice is great, but the story was just stupid and doesn't make sense. Why would Braniac say that he was watching out for Super-Girl and say that she was the only one who could stop him or w/e when Superman was right there in the past. Like Braniac didn't know that she'd be sent into the future, so how would he know to watch out for her in the past? \n\nWhole plot was a convoluted mess. Also, Dawnstar's design was just butchered here. I much preferred her design from JLA Adventures: Trapped in Time."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "Thought i was gonna see a Legion movie but this was a Supergirl movie.\nA lot of b*tchin' and moaning and just meh."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "I don't get how this is a new movie!?! I seen this movie years ago"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "awful story, did not even finish the movie due to terrible plot & sloppy sexual writting. just rotten"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "Sad how good this movie could be. I think the biggest issue is the overexplanation of evertthing. Like, why kara is beeing kick out the earth, why they can contact the rest of the legion, who is the infiltrade in academy of heroes. Why dont you show this things insted of telling littery what is happening.\nI would love it if kept the mystery of who kill tripiclate girl longer to us and making suspect braniac or other academy hero members, it would be gold but no. They show how has right in the begging and, the worst thing ever, later they made Mon EL make a villan speech like \" I'm the one behind this\" ( WE ALREDY KNEW ) , and NOBODY suspected of him?? ( not even the smartest guy in the universe ) and the shapeshifter pet knew and didnot told kara, or braniac, or the legion leader, or any one. \nThe animation and aacting is good, and the reason why braniac do what he is doing it can be authentic and understanble. The look of the endless circle is soo AMAZING and the ending of braniac 1 death its just great, the pride of all the braniacs kill him. That was not told so its a win."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "DC's animated movies are usually pretty decent. This is just awful. The animation is choppy when it's actually animated, and it uses a lot of bad CGI. They really cheaped out on the quality and it shows.\n\nThe script and acting direction is also really weak. When it's every single person I blame the direction and not the actors themselves.\n\nI can forgive something that looks terrible if it is compelling, but it's not. It rushes everything and gives nothing time to breath. \n\nFor no apparent reason they give you a 15-minute rehash of Supergirl's origin story before they get into the actual plot. It has an 83 minute runtime, so I guess they just didn't have 83 minutes worth of story and decided to fill some time with an origin story...but if you're gonna do that, pick a character that hasn't been done to death. I really hate when they hit you with an abridged origin story in these things, especially when it's one that's been done in movies and TV multiple times already. \n\nIf it was an origin story for Cosmic Boy, that'd be something the general public aren't familiar with, and it'd be one of the founding members of the Legion of Super-Heroes making it more appropriate for the movie.\n\nHell, make the whole movie an origin story of the three founding members, get people to know who they are. \n\nOr...make it a Supergirl movie, because that's what it basically is anyways. Cut out the origin story, cut out the time travel, make it a \"Superman is busy, someone has to stop Lex Luthor and his hired goons.\" \n\nI don't care so much about what direction they go, they can do the Supergirl joins the Legion story, just animate it well and make it compelling, starting with cutting out the 15 minutes of nonsense at the start."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "It's not the best but it's definitely not bad... it's an enjoyable movie"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It's great feel good nd Supergirl centric film nd all others also makes the new era of supers nd gives chilling nd thrilling rides with twist nd turns nd thrilling suspense cliffhanger of Warworld ♥️😃🥰👌🌟👏"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It's Amazing, I love it. ❤️"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I loved that we finally see a caring Kal with Kara, more of her background story and how she really feels since arriving to Earth and of course the decisions she makes by herself and not forced by others, as a fan of the character of Supergirl I'm very pleased with this movie. The action scenes were great and I enjoyed them so much, hope to see more of Kara soon."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I love the fight between the supergirl an mon-el"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Esta increíbleeeee, amo esta película."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "More like supergirl rather than legion. Am I the only think that brainiac and super girl relationship is too rush and trash? The movie however are able to deliver the super girl's struggle in the new world, but the superhero in 31st century world is kinda nerfed. The scene of batman and clark is too short, audience might be looking forward to see their connection with super girl instead of just throwing her away to the 31st century."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "More Supergirl than Legion but a lot of fun."}]}}, "emsId": "7e63f52e-e38a-3a43-a27c-fa11390b020c", "emsVersionId": "d0865082-d67b-3ab3-b3cf-49e54576ae30", "movie_name": "Legion of Super-Heroes"}