{"data": {"audienceReviews": {"totalCount": 1879, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Thought it was fun. Cute guys which we loved. Went with a good friend on Valentine’s Day. Was the perfect movie for the day. Recommend it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "This movie was so cringy. Watching Tatum and Selma was so creepy, never want to see that again."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "Love both actor and actress but this was a slow watch and not boring."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "It could've been much better. I wanted to see him do Pony again, just him. He barely danced at all, and I get he was the director but he is magic mike so we wanna see him dance. The plot was dumb and I am very disappointed!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "What an awful film with an even worse ending. Don't bother."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Nothing like the first two movies. Absolute snooze fest."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Mauvais … je ne comprends rien de ce film … il n'aurait jamais dû faire un troisième 😨"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "Salma Hayek and Channing Tatum in the same movie should be good, right? Unfortunately, neither of them can convince in their role, and the film's story is thin at best. Granted, there are some beautiful dance scenes limited almost entirely to male dancers, and there are some funny moments, but that is just not enough to lift this film above the 'also ran' category."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "No magic in this Mike"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "This does not surpass the first 2 movies, the storyline was bland and felt as if they were focusing more on Maxandra than mike. Didn't enjoy how the old cast was only in there for 3 seconds (the old crew is what makes magic mike good. However, the dancing was incredible especially the start scene!!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Channing was charming, Selma looked a little bit too old in some shots. Fun ending with very good dancing. Plot simple."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Loved it. And the plot and dancers"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "The best part was beginning when Channing danced and the end when he did.\nStory line poor, and felt too British and wooden! Really enjoyed the other 2, but this one really disappointed."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Boring. Sad mood. Odd vibes between Hayek and Tatum. Plot isn’t great and Hayek doesn’t play her role well. Tatum looks like he’s over replaying this record. "}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Much better than Magic Mike 2, with more heart and charm. The dancing really was great too. The last dance with Mike and the ballerina was beautiful. Selma Hayek was a lot of fun. A fun movie for a girls' night out!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "Yes we came to watch you dance, but this story needed a much tighter ending. British narrator was distracting. The dancing was fabulous tho! And we all love Salma."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "The movie started off like you expected, then completely changed. The plot is thin which is fine for a magic Mike film, if it is compensated with a mountain of stripping. But this is not the case here, it felt like they didn't know why people watch magic Mike films."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "The dance scene between Channing and Selma was AMAZING!!!  All the dancing was great."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "not the best in the franchise but that more from the unusual plot, the dancing is still very good and the chemistry between the leads is believable. overall a good watch"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "It was a good movie.  It was sensual and full of talented dancers."}]}}, "emsId": "65013f48-9a02-3b40-a131-c197b3d8ef9a", "emsVersionId": "51644c4e-6edd-3de7-8b39-f593bea45c2e", "movie_name": "Magic Mike's Last Dance"}