{"data": {"audienceReviews": {"totalCount": 222, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "You could tell this was based on a play. I've never seen it but I imagine it's not too different from this. While not amazing, it wasn't bad, and the star power they pulled in (To play the parents anyway, not the kids), made it even more bearable."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Funny, sad, realistic. "}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Terrible..  Such a great cast.  Too bad.  There was no ‘Rom' or ‘Com' in this movie.  Not funny and bad acting..  A shame..  Maybe time for a few retirements from the movie industry.."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "There's no good dessert really for our sugar right after a meal but take this as a complimentary dish on the house because the main course was hardly tolerable. If 'Your Place Or Mine' (Netflix) failed to launch as last Valetine's major rom-com (still not sure if the flop was actually about Ashton Kutcher's career in light years or was Zoe Chao supposed to resemble Demi Moore?), Michael Jacobs' adaptation of his original play 'Cheaters' was just right on time with its tougue-in-cheek dramas and enough excuses on infidelity that couldn't actually look better on both Richard Gere and Susan Sarandon. It's agreeable for every viewer that sparkling reunion can be pulled off by only these two most sterling pair of a silver fox and a ginger vixen onscreen eighteen years after Peter Chelsom's unforgettable 'Shall We Dance? (Miramax Films) and, suffice to say, Sarandon's plastic surgery job did pay off marvelously for her age and injury from the fall accident in 2019.\n\nAnd then, our complimentary dessert gets a little too saccharine and addictive. Diane Keaton's nestor housewife character, opposite Gere as the vulnerable devoted husband and his first extramarital affair partner played by Sarandon, who would develop an intimate friendship with her admirer coindentally the latter's husband (William H. Macy) was cool as dope like Tig Notaro who played the uncanny best friend of Reese Witherspoon's single mother character in 'Mine'. Best still, crunches inside the dessert as you sank your teeth in are both couple's children (played by Emma Roberts and Luke Bracey) about to tie the knot. Incest trouples.\n\nWIthout paying attention to the credits, the poster design and cast assemble of Jacob's directional debut have a similar appearance and qualities in common with Nancy Meyers' work but more of a multi-generational modern rom-com with upclose sentimentality in how the characters under the same roofs eventually had to deal with everything's hidden from the surface of lifelong or soon-to-wed relationships.\n\nA scrambling, hilarious but hopeful take on love, marriage, and happiness. The only fallout of the screenplay is that the least good-looking Macy's character did not sail off quite well like others in the ending.\n\nOriginally distributed by Vertical Films in association with production from Fifth Season and Vincent Newman Entertainment."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "It wasn't great but it also wasn't bad. It is a strange movie because it seems to have originally been a play but when it was adapted it still feels like a play. The cast seem to be acting towards the audience rather than to each other like in a play."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "It was more entertaining than I thought it would be. The most annoying thing about it was Diane Keaton, sorry about that, but her acting is too pretentious. It was mostly predictable and not funny but wise."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Expected a rom-com, but ended up with an awkward 90 minutes.  Was not as much comedy as I thought.  Premise stood a chance but the execution was lacking."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Terrible. \"Plot\" is beneath contempt. Diane Keaton appears to be wearing diapers in her old-man pants. Richard Gere is simply painful to watch. Susan Sarandon makes a valiant attempt to inject an ounce of life into this corpse. Bravo to her."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "This is quite literally the worst movie I have ever seen."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "A master piece in the art of bullshit. So american, with dated love discussions, no real connection to reality. I feel that I've seen this movie a thosand times, its the same watery plot that any other sugary romance movie. I hated."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Honestly, this was a really good movie. A bit on the corny side due to the plot, but was a cute worthy watch."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "This was a painful and cringe worthy movie.  I would have left early if I knew at the the time my wife disliked it as much as me."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Well, what can I say. It's slightly funny, very, very slightly funny. The whole flick is mainly carried by Emma's charm and the eternal perfection of William H. Macy. The rest of the cast seems only to have done the bare minimum to get their pay check. We all know this kind of person among a company's employees who come to work, sign in and then just sit around, read the newspaper or hang on their phone all day long before signing out at the end of the day. Well, that's pretty much what the whole cast of this movie did, except the first two mentioned. It is pretty much like a theater play forced onto the big screen, completely forgetting that you have more possibilities on the big screen and don't have to limit your scenario to the bare minimum like on a stage. The chitchat is mainly forced and seems to have come from a school play, thus keeps you bored throughout most of the fortunately short 90 minutes. 3/10 points"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Lo escribiré en español para poder expresarme mejor, la película no tiene sentido, las historia es muy confusa, la manera en que narran las diferentes historias es lenta y las conversaciones eran totalmente absurdas.\n\nNo tiene un propósito la película ni un fin, solamente fue ver la misma actuación de emma roberts y lo incómodo que te hacen sentir las conversaciones sin sentido."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It's a fun little movie, I had a good time"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "What a waist of time.. This movie is worse than 'Grand Piano, 2013'.."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "It was okay. I sounded more like a poem than a movie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I really enjoyed this movie. I thought it gave a very realistic view of what relationships are like the struggles and the trials people in and out of love face. It was funny and honest and I personally appreciated it's heartwarming message of love."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "It’s kind of sad that a movie with such good actors was so blah. Mediocre story line, slow to develop. "}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "I wanted to love it because the cast is fabulous, but it was lukewarm at best."}]}}, "emsId": "9e0374c2-796b-47ad-9393-de6c1cfc9b14", "emsVersionId": "00cdfa49-460c-4b56-b051-4fe22d5a7195", "movie_name": "Maybe I Do"}