{"data": {"audienceReviews": {"totalCount": 11, "nextOffset": -1, "hasNextPage": false, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Josh and Rebecca Tickell's \"On Sacred Ground\" portrays the vibrant spirit of First Nation protesters in the face of the DAPL taking over their sacred territories. I believe the film is made with so much love and respect for the Sioux that you feel as though you are a part of their cause throughout the film. \"On Sacred Ground\" took me on a journey where my concept of truth was challenged and where floodlight is shined on issues such as PTSD, environmental conservation, and a riveting debate of tradition versus modernity and urbanization. Watching \"On Sacred Ground\" is a wonderful experience where movie fans can enjoy a film that connects us with our humanity and the planet that we live on."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Josh and Rebecca Tickell's \"On Sacred Ground\" is a tragic drama following the construction of the Dakota Access Pipeline. The story takes us along a struggling journalist trying to please the oil companies by writing a piece on the pipeline. The main character Daniel played by William Mapother indulges into his internal conflict as he faces the behind the scenes of the pipeline. The tension thickens as the Sioux tribe is willing to defend their land, the built up pressure is tangible as protests begin to form taunting the oil companies.  This cinematic masterpiece has some powerful scenes with strong authentic messages that take place in real time. The interlocking of perspectives from each character arouses curiosity from the audience revealing the two different sides of the story. This movie is an emotionally strong film that is definitely worth giving a watch."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "On Sacred Ground is emotionally compelling due to its layered storytelling and incredible heart. Directors Josh and Rebecca Tickell build upon the already moving narrative with stunning visuals and cinematography. By overlaying headlines and graphics related to the Dakota Access Pipeline conflict, the film fosters a powerful visual rhetoric that reminds the audience of the real-life consequences of this story. The pipeline's threat to the Standing Rock Indian Reservation directly impacted real individuals from the Lakota \"Sioux\" tribe, who as a result took direct action against its construction. The portrayal of the Indigenous community members and allies that protested the pipeline is another one of my favorite aspects of the film. Kerry Knuppe's performance as Mika was truly exceptional and added depth to the already emotionally nuanced narrative."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "On Sacred Ground, directed by Josh and Rebecca Tickell, is an eye-opening film that is based on the true story of the controversial continuation of the Dakota Access Pipeline. For individuals who lived through this modern issue or for ones who have never been introduced, this motion picture tells this story through a whole new perspective. The direction of this film was excellent as it followed the veteran point of view, while simultaneously emphasizing the importance of upholding indigenous rights. The theme of On Sacred Ground is to emphasize a fight for equal rights while showing respect to all people. For standing up for their beliefs, the Lakota \"Sioux\" Tribe is being exploited in the news as they protect their land. The scope from each perspective in this cinematic picture is what makes this film so special. The movie does not just lay down the facts, it brings out the emotion and the ethical dilemma all parties had to face. The unique perspective takes viewers for a ride. On Sacred Ground demonstrates the important concept that there is not just one side to a story, which is why I strongly recommend giving this film a watch!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "On Sacred Ground by Josh and Rebecca Tickell is a stunning historical drama that captures the divide between two different sides of the construction for the North Dakota pipeline in 2016. The main character, a war veteran journalist, played by William Mapother, sets out to write a story on the truth of the pipeline dilemma, and to ultimately decide which side he takes, the oil executives or the Sioux people. His character stood out to me greatly while watching the film, a nod to not only the injustices of Native Americans but also the treatment of veterans who have served this country. Mapother's acting is intense when experiencing PTSD while witnessing the attacks towards the Sioux on the frontlines of the pipeline. His performance beautifully captures how connected we all are, no matter our background, and that of the human experience. For fans of underdog stories, I highly recommend this film."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "The Tickell's have beautifully captured an emotional story of the true events of the 2016 Dakota Access Pipeline protests in their new film On Sacred Ground. Known for their documentary style movies, Josh and Rebecca Tickell have skillfully captured what is their first narrative style movie. On Sacred Ground follows Daniel McKinney (William Mapother), a journalist who finds himself on the opposite side of his employers, oil company executives Eliot (David Arquette) and Ricky (Frances Fisher), regarding the Dakota Access Pipeline running through the Standing Rock Indian Reservation. Through meticulous close-up and wide shots, the camera becomes a character in itself. As a result, I, the viewer, felt a more profound connection to the story and experienced moments of both pain and beauty along with the characters. The Tickell's have truly immersed me into this film and have surpassed the superficial level of simply watching a movie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "The fact that this is a true story told by one man searching for redemption."}]}}, "emsId": "56193d3c-b0eb-3549-9867-b659d0e221a4", "emsVersionId": "b4ae784c-c7fb-3284-9268-cd3593d6e330", "movie_name": "On Sacred Ground"}