{"data": {"audienceReviews": {"totalCount": 584, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I hardly know anything about Pamela Anderson, but I felt inspired to watch this documentary. I found her to be really sweet and was drawn in from the start. It's so interesting hearing about her life and it's a very good watch. I feel so sorry for all she's been through. She's an inspiring, strong lady and should be proud of herself. Life has dealt her some blows, yet she carries on. Truly inspirational."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "\"Pamela:  A Love Story\" is a well made documentary on the turbulent life of Pamela Anderson.  The interviews featured in the documentary are well done and are rather informative.  What I liked about the documentary is it gave the viewer a look at some of the major events in Pamela Anderson's life from her perspective.  The most prominent moment would the theft of the infamous sex tape and the consequences that caused.  As I am sure you know, once the tape became public rumors started to fly saying Pamela and her then husband Tommy Lee intentionally released the tape to the public for publicity reasons.  The documentary offers strong evidence to show that is false.  In my opinion the best evidence is the fact that the late Bob Guccione offered Pamela and Tommy $5 million in cash for the rights to the tape which they declined.  Another highlight for me is the footage of Pamela rehearsing for the role of Roxy Hart in the Broadway revival of \"Chicago\".   A very fitting way to end the documentary.  \"Pamela:  A Love Story\" is one of the better documentaries I have seen recently.  I highly recommend it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Authentic and fun.  Pamela Anderson is beautiful inside & out.  On a thrill ride without a seatbelt, she's not trying to be anyone but herself.  I just wish she had a better \"picker\" for her suitors.  Love you girlfriend!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I'm still emotional after watching this earlier.  This woman went through so much while people like me .. back in the day .. believed the headlines.. made assumptions.  This woman is deep and she is a fighter. So inspirational.  I decided to watch this because she is vegan but wasn't expecting all the feels.  Just wow."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Loved it,    Great watch"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "My wife adores Pamela Anderson so we watched with excitement. Very raw, very real and really well done."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Very interesting to hear Pamela's side of her life story.  Well worth the watch."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Amazing! Truly a work of art that everyone must see."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Pamela: I want to move on from the sex tape.\n\nAlso Pamela: let's make a documentary centered around the sex tape.\n\nTotal Rick James cocaine logic…\n\nAlso, this is the unintentionally hilarious comedy of the year. There's sections that even The Lonely Island wouldn't punch up.\n\nDumb. Dumb dumb dumb people."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "What a life she's had.  She's a combination of uber sex kitten and wholesome country girl.  Very entertaining.  And thanks Pam for not ruining your face with plastic surgery and being so vulnerable.  Great movie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Very interesting. She's so honest and vulnerable. Too much unrequited footage of Tommy Lee, though"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "A surprising  look at Pam`s life. I thought it was fresh, smart and honest."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This showbiz documentary was really good. The entire crew did a spectacular job on making this documentary. This true story about model/actress Pamela Anderson was dramatic, tragic, and shocking. It really goes into detail on her career and personal life. If you're a Netflix member, you should watch this documentary sometime. It's a definite must see."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The opposite of the image that had been sold - and bought - for years: an unmasked funny human being with stories many will love to hear from her voice"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is a riveting and heartfelt documentary. I first became aware of Pamela Anderson when she appeared in Playboy, a magazine I subscribed to at the time. Like many, I was struck by her beauty. She later made a name for herself while featured on the show Baywatch (apparently one of the most widely viewed TV series in the world), a program I never watched. I later heard the news reports of videotapes showing her and Tommy Lee having sex that had been stolen from their home and distributed illegally. I didn't watch that either. Then recently I read that Pamela had starred in the musical Chicago, playing Roxie, to rave reviews. I wish I had seen that show. That was the extent of what I knew about Pamela Anderson until this film. It is a love story. A sad one too. Yet a heroic tale of fortitude. We discover she is a prolific writer from an early age and throughout her life, making observations and filming the highs and lows of her life. She admits making some stupid decisions in the quest for love. Her intelligence, sense of humor, along with her love and devotion to her sons makes her shine. In this documentary, Pamela controls the narrative of her own story, not the tabloids and paparazzi. Hers is a fascinating journey."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It’s a documentary that, for whatever reason, makes you think about how fast time passes in your own life. It feels like a very personal watch, very relatable. How this became such an emotional view for me, I can’t say, but it was. Loved it. "}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I think it was well done..real and emotional. She lived her life with her feelings, with her whole heart every day.  We make the best decisions we can.  Life is tough, trying to do what is best and dealing with the other emotions from partners and family. LIFE IS TOUGH, you can't regret mistakes or decisions you make, you just have to follow your heart and do the best the best you can and hope the people that love you can relate and understand. I thought it was EXCEPTIONAL AND I FELT HER EMOTION*****"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It was great to finally hear the truth about Pamela Anderson and not the rubbish the tabloids have constantly spun over decades. I am so pleased I watched this documentary and have gained a deep respect and appreciation for the courage, resilience and strength she has shown while her life was being torn apart through no fault of her own. Today, with the love of her children, she stands tall."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Please come out with a part two!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I loved it!  Pamela was so genuine and honest especially for someone who has been through so much!!! No negativity and she easily could of portrayed that persona. She was a captivating …Well Done Pamela!"}]}}, "emsId": "a85d7222-1c9d-435c-a6be-bfdc9700f583", "emsVersionId": "2a6e8e64-2516-4f3a-8068-57127bcc15ff", "movie_name": "Pamela, a Love Story"}