{"data": {"audienceReviews": {"totalCount": 7537, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Don't listen to the negative critic reviews. This movie is a lot of fun and worth seeing in theaters."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Just seen it with my 2 kids. they loved every second of it. Me and my wife really enjoyed it too."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "A fun movie for the family I love Shazam and now my sons love it to..I grew up in the 90s this movie is like all the great movies I loved as a kid like  star child…or power rangers…it does what it's meant to do entertain you and be a popcorn flick for you and your family"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Not a perfect movie, but not every movie has to be that! I love movies that are just for fun, to make me forget everything and this movie does that! It felt like it was made for us nerds, so many references. I laughed so much and cried too! Definitely give it a change. Just don't expect the best hero movie"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Loved it!!!♥️ We went to see it for our family movie night and watched it in the DBOX seats at our theatre and oh my goodness did I have the best time. I love superhero movies and this did not disappoint! It was just as funny and fun as the first one! Even my mother in law ( she's 74) who hasn't seen the first one and doesn't really watch these kind of movies loved it! Can't wait for the next one!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Yet another Film proving you should just ignore critic reviews and look at the audience score. This film was a great watch, I genuinely didn't dislike anything specific about it. I will admit, there wasn't much that stood out about this film but there were still moments that connected to me. This film is not perfect, but nothing really is. Go see this movie, I promise you'll enjoy it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Good mixture of youthful comedy, with a strong mythic storyline. Lots of action, creatures, and emotional setups. Great DC movie, which should have been released during the summertime."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie was incredible! This is a must see!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I thought this Shazam was pretty good and had a better story line than the first. Why it is ranked so low is beyond me. Reviewers are undoubtedly non DC fans."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "I think the movie is better than critics give it. A good sequel, funny when needs to be and serious when needs to be which is how the character is. I hope Shazam/Zachary Levi can transition into the new DCEU with James Gunn!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Fun time, worth the trip."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Cant stand the main actor Levi, i think his personal problems with himself shines in his character."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Superheroes, dragons, comedy. I liked it. It was nice to be able to find a lightweight enjoyable movie. No blood 'n guts, no torture. Thank you! Helen Mirren and Lucy Liu were a kick. The entire cast was excellent."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I absolutely LOVED it! My family and I were so excited to see this movie and it did not disappoint! I loved everything about it and it was SO much better than the first movie and that says a lot because I really liked the first one! I don't ever want to say goodbye to these characters, I love them so much."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "This movie was funny & light yet had a storyline that was engaging for the whole family without being childish - and was extremely well cast. Not sure what expectations others had going in - I saw it with a few others and we all enjoyed it! Now granted, some of the story elements seemed a bit disconnected/choppy, but I imagine this was due at least in part to post-production editing. My biggest gripe was that I don't think this got nearly the promotion other films of the genre get - I thought it was coming out in the summer. Anyway... a job well done to all - David, Zachary and everyone else involved!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Its that kind of movie you can watch with your family during the weekend. It has all elements of a family movie, enjoyed every part of it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I know people have their reasons for not wanting to see this but my family sure enjoyed it. It got straight to the action and had many funny parts throughout the film.It is smart for DC to make lighter movies that are meant to hook kids. This definitely did that as my kids and I thought it was even better than the first movie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The first movie was okay, but this one was surprisingly good. The comedy aspects were not too cliche, the ride of emotions was pretty spot on in my opinion. You see the characters progressively evolved, storyline was interesting and maybe your common new villain in the scene type of beat . Definitely an amazing family-friendly movie. Shazam's character was more spot on and alike with the animated ones. It's unfortunate we don't see the rivalry with the other character/ alter-ego! 10/10, recommended to watch!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "no words.. I was bored 5 mins in.. what was the point of this sequal? Horrible script, that is why it bombed at the box office."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I absolutely loved this move! I think it was better than the first one. I can't wait to see what happens next."}]}}, "emsId": "cb14bef3-e8de-3587-8519-8216a6ef7f39", "emsVersionId": "1159ad76-81a9-3304-8bb5-007bf538507f", "movie_name": "Shazam! Fury of the Gods"}