{"data": {"audienceReviews": {"totalCount": 301, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "\"Somebody I Used to Know\" is a sweet and honest addition to the romantic comedy genre. This movie definitely leans more into the dramatic side, but I think it comes from a place of honesty and is told with many humorous moments. The characters make plenty of mistakes but I think it makes them feel more genuine. I respected the ending of the movie went with and think it is something most young people reflecting on the people we used to know when we were younger can connect with. Overall, it is a charming movie that hits some familiar genre beats, but also has some sharp writing that gives it a voice of its own."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "A woefully unfunny script sinks  great work from its star."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "A very enjoyable movie. Great acting. Great little twists. "}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "More Alison Brie and Danny Pudi on my screen please!!!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Top-tier romcom! \nNo doubt will watch it again"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This film is truly a drama, romance, and striking comedy. Fantastic cast, storyline, and one of the better movies I've seen recently."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Dave Franco and Alison Brie has done it again! Along with the rest of the cast, they were all amazing. They swerved some of the usual tropes and the ending was very nice."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "A few friends recommended this one. It's a smarter version of what you might think"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "More drama than comedy, but not in a bad way! I really loved it"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Worst movie ever! Story is too cliche"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Alison Brie is a treasure. Put her in everything!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "A fun story that has some twists and turns. Definitely worth a watch!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "My girlfriend wanted to watch this and I ended up really getting sucked in. It's a fun ride and I loved all the actors. Great ensemble"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Every word out of Haley Joel osment's mouth had me on the floor! Two very big thumbs up!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "It was almost unwatchable from the beginning.  So predictable and boring.  Too bad because there was a great cast, but the story line, oof."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "It was a fun movie. I enjoyed watching it"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I don't normally watch romcoms, but I actually really enjoyed this. Definite recommend"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "This is one of the stupidest movies I've ever seen. Run away as fast as you can."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "Filme gostoso para passar o tempo! Drama e comédia na medida certa. Recomendo!\nPs: Os personagens coadjuvantes dão um show!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Somebody I Used to Know is a pleasantly funny, quite enjoyable romantic comedy. No world breaker but a very nice way to pass the time. Ally is a TV reality show producer. When her previously successful show gets cancelled she decides to return home to Washington state for a reset. There she meets Sean, who she was in strong relationship with many years ago. They instantly click again and Ally thinks they might be able to get together again. But the next day she finds out he is actually engaged to Cassidy. So ensues a dilemma for Ally as deep down she wants to stop the marriage but doesn't know how. She also gets to know Cassidy and like her as she reminds her of herself many years ago. It makes for many awkward situations and back and forth as the film navigates the perils of love. It's all fairly entertaining without any real weight. But it's worth a watch alone for the presence of Alison Brie as Ally. Her sweetness and humour are always a winning combination."}]}}, "emsId": "15ef8941-65ce-4e10-b83e-0ccd2597d56f", "emsVersionId": "9d9f524d-05b5-40f7-bc95-31d5e7cff9cc", "movie_name": "Somebody I Used To Know"}