{"data": {"audienceReviews": {"totalCount": 1898, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I think the movie is great but, I don't want it to end because after season 6 now I'm curious to see what happens to Derek after he became an alpha."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "I wish I never watched this movie…it ruined the whole tv series for me"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "The revamping of Teen Wolf suffered from some bad fight scenes and graphics...cheesy cheap stuff. The nostalgia of the cast coming back couldn't save it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Great seeing a huge part of my child hood back together, film was an amazing piece of nostalgia and the storyline was good. The movie does feel kind of rushed, but ofcourse time constraints are most likely to blame.  I think I would e been better suited being another series or a two part film. But all in all amazing watch highly recommend"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "They never missed a beat from the series which I saw every episode!. Hopefully there will be another movie. Pissed they killed off Tyler Hochlin's character"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "I love Teen Wolf, but this was a big NO for me. So much fan service leads nowhere. I understand that Dylan didnt want to appear in movie but you dont have to immediately end his relationship with Lydia because of that. This movie is a huge dissapointment."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Look I love the actors but let's be honest the movie was a hot mess and while crystal Reed is a great actress her role in teen wolf was (for lack of a better term) dead and buried. They could've had an amazing movie but settled for something that was frankly ridiculous bringing back the Oni without Kira was bad writing and Tyler posey saying that he was teen wolf and the series/movie could exist without Dylan O'Brian was ego talking I mean no offence to him but majority of fans identified with Stiles more than Scott and creating a movie that didn't have more then mentions of him was idiotic the movie was just another bad spin off that should've never been created unless it was done the right way."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "This movie is so bad I don't know how it got made in first place."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie rocks!!! I hope there will be a part 2 🤞🤞🤞🙏"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Foarte bun merită vazut mia fost dor de el"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "So glad to see Teen Wolf Back at it! While there are glaring omissions (I.e.: Stiles, Theo, Corey, and Kira not appear; the Hunter plot line from the final season and the finale as a whole is not referenced,  original tv series music), there is a lot here for long time fans! Plot lines, characters, speculations all picked up and resolved in some way. The dialogue now benefits from an 18 rating and adds some more fun and depth. The ending, as in typical Teen Wolf fashion, leaves a lot open for the future and I for one and excited to see more! It's by no means perfect but if you're a real fan give it a watch and let's support Teen Wolf! Thank you to everyone who worked on this film and I hope there's more to see of Beacon Hills and our favorite characters on the horizon!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "It gave me a sense of closing with some of the heart break encountered during the series. Although I had hoped some other individuals would return, it was all in all a great movie. Lets hope there's an opportunity for some older characters to return."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Wear wolves do not have fangs, that's a vampire.  Totally stupid"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Being that this was one of my favorite shows and I was waiting for a spin-off or movie for the longest I was very disappointed with this movie. Not only did they mess up one of my favorite villains this movie had no plot and you can tell they just threw it together. They did all of this just to bring two people back together and they're ruining great characters. I went from wanting a movie for years to not wanting them to do anything else with this show because they're ruining it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "This movie was genuinely the worst movie i have ever seen. I was hoping that might be the point of the film. To be so bad it's funny. But it wasn't, it was just bad. I heard that a second movie is supposed to come out, and all i have to say about it is that i absolutely will not watch it. And i would not advise anyone else to watch the movie either."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "The movie created more plot-hole derrived questions than it gave answers. The timeline does not correlate with the show in the slightest. Returning characters seemed more like accessories to draw fans in than part of the story. Story lines that seemed important were brushed to the side while they danced around the massive hole in the cast. The movie left veiwing party beyond disappointed and uninterested for further development."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "PART 2 we need moreeeeeeeeeee! sincerely, an alpha 😈👹"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Great to see the pack from Beacon Hills again, though I missed Stiles and Ethan. Would love to see a new series with Eli Hale as the main character. The nogitsune plot wasn't what I expected but it was ok. Just seemed a bit old."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "it was the best movie of the teen wolf tv seasons together. I would definitely watch it again and the new season if it comes out."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "This is Tyler Posey's spank bank movie, let's just be honest."}]}}, "emsId": "28b6bcb7-ed0f-49a9-bd1d-eeadfe19f868", "emsVersionId": "ab9774ee-56f1-4ba3-aeb9-e4432f9a08ac", "movie_name": "Teen Wolf: The Movie"}