{"data": {"audienceReviews": {"totalCount": 15, "nextOffset": -1, "hasNextPage": false, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It contains TETRIS, it's the best movie of this century and instant classic."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "absolutely love this movie and the cast, especially taron egerton!  loved how they weave in the game graphics with the movie.  the music is spot-on and enhances the entire picture.  you gotta see it!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Wonderful telling of a very interesting story! Had no expectations and thoroughly enjoyed. "}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Great acting, neat story. Would recommend!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "MOVIE REVIEW\nTetris\n –     \n\nGenre: Biography, Drama, History\nYear Released: 2023\nRuntime: 1h 58m\nDirector(s): Jon S. Baird\nWriter(s): Noah Pink\nCast: Taron Egerton, Nikita Efremov, Sofia Lebedeva, Anthony Boyle, Toby Jones\nWhere To Watch: premiering on Apple TV+ March 31, 2023\n\nRAVING REVIEW: TETRIS tells the story of how a treasured video game came to be and the hurdles that were overcome to get it there. Set in the backdrop of 1988, a determined businessman Henk Rogers, played by Taron Egerton, travels to the Soviet Union, where he partners with the game's originator to bring TETRIS to a global audience. Inspired by actual events, this film captures the essence of a Cold War drama, with cunning enemies, unexpected heroes, and a gripping race against the clock.\n\nThe narrative highlights the extraordinary partnership between the entrepreneur and the mastermind behind TETRIS. Together, they join forces with their drive to share the game with the rest of the world. The film struggles to develop some Russian characters, leaving them one-dimensional and almost like a caricature.\n\nNevertheless, the director, Jon S. Baird, constructs a tale of espionage filled with clever twists. The visual depiction of TETRIS, from its simple text-based roots to its renowned Gameboy version and beyond, is brilliantly exhibited through imaginative moments throughout the film. Additionally, the filmmakers employ pixelated animations and dynamic block sequences that pay homage to the legendary game. The production design and costuming effectively transport the audience to the late 1980s and the tense atmosphere of Cold War Russia.\n\nThe story covers Rogers's first encounter with TETRIS early on, shifting its focus from the game's creation to its discovery, branding, and global dominance. While Egerton's performance is exceptional, the film is aided by a supporting cast that helps boost his performance. \n\nTETRIS is an exhilarating ride that prioritizes entertainment value over strict adherence to historical facts (as most historical biofilms like this do.) The plot encompasses many disputes and gaming companies competing to make TETRIS an international sensation. Amidst the turmoil, Rogers confronts personal struggles as his fixation with the game jeopardizes his family life.\n\nEmbracing its idiosyncrasy, TETRIS has a nostalgic musical score, adding to the authenticity of feeling like you're along for this journey. Though the plot can sometimes feel like a game of Pong, it ultimately presents a sleek, tech-driven narrative that resonates as the espionage thriller it wants to be. TETRIS tackles bureaucracy and capitalism while taking us along on this whimsical journey.\n\nIn summary, TETRIS is a charming film that offers a fascinating look into the early days of one of history's most popular video games. Egerton delivers a powerful performance, and the film never fails to entertain. The film could have been edited to make it more streamlined, coming in under two hours, but that never hindered the viewing experience. Despite these minor flaws, TETRIS is a must-watch for gamers and fans of suspenseful, high-stakes adventures.\n\nFor more reviews and my YouTube channel, please visit linktr.ee/Overlyhonestmoviereviews\n\nFollow me on Letterboxd, Instagram, Twitter, and YouTube. Find my social media accounts on most platforms simply by searching Overly Honest Movie Reviews.\n\nI'm always happy to hear from my readers; please say hi or send me any questions about movies."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "A ride through and through!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "A fun fresh film featuring fantastic actors. Loved the juxtaposition of live action and 8-bit graphics throughout the film. The musical score lent itself well to world building especially the soviet covers of popular American 80s tracks, seamlessly slipping into the Tetris theme song to add tension. The writing was great, loved the flow Noah created. The character archetypes were fun and showed growth. The pacing was great. This is a great movie that will leave you feeling happy, add it to your watch list."}]}}, "emsId": "da00a95b-d98b-4664-adcc-ca6ae4b6edeb", "emsVersionId": "97d9e2b6-49ca-47a8-af5c-d34390757521", "movie_name": "Tetris"}