{"data": {"audienceReviews": {"totalCount": 46, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "I stopped myself 7 minutes from the end of this movie to give a scathing review. How. Dare. You. Sir?!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Absolutely dismal.  This guy whines about his girlfriends and provides meaningless anecdotes about nothing but meanwhile can travel around the world for a year and \"learn a couple of languages.\" From what I could tell he didn't face cancer, disease, unemployment - even the difficulties of balancing responsibilities like children, family, and work. At best he learned that Instagram is disappointing and not the real world. Boo-hoo."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "A documentary about how not to be a whiny person told by a very whiny person. I feel like the lesson to be learned could have been summarized with a lot less personal backstory."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "Can't believe this guy has had success observing some really basic things in life and then telling his story..  I do hope it's helped people but there are definitely better ways to spend your time or better yet, more inspiring experts to listen to on this subject."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Exactly the movie that Everyone should see! Very meaningful & straight to the point. This could really help society today!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "It is amazing how many paradoxical affirmations he mades.\nOne single example and i am done with this : \" negative emotions are more important cause you cannot trust all your positive ones\".\nAnd you can trust ALL the negative, right ?:)\nChildish.\nShallow.\nUseless."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "There are a lot of good points in this movie and it was enjoyable to watch."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Well, I get the premise of this, however for the most part, and maybe it's just me, but through the majority of this documentary, what the F*#% is he talking about?!?! and why the over-the-top optics???"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "If you've read the book, this is a good companion to it. Not going to have all the things from the book, but I enjoyed it none the less."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Provides invaluable advice delivered with comical relief, honesty, and a bit of absurdity to keep things exciting. 🙃💜"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Manson is right when he says people are entitled and want everything now and want everything to come easy very interesting and great acting with extras"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "Mark Manson, the author, essentially told his own story along with a couple of other tales from the book of the same name. He was personable and I enjoyed hearing him talk about his life and revelations, but this went on way too long for a feature. The stories about people giving away too many fucks were essentially retold with a myriad of graphics and a barrage of film clips. IMHO, it should've been cut to about an hour and dragged a bit for its message. I really wanted to love this movie because I enjoyed the book so much. As it is in so many cases: the book was much better. Wait for it to stream."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "Having read the book, I was interested in what the movie would be like.  It's a nice companion to the book but added nothing new and leaving a lot out.  If you haven't read the book, there is plenty to like.  My wife enjoyed the movie and found value in what he had to say.  \n\nI recommend this movie for two types of people:\n1. Those that haven't read the book and want to know what it's about.\n2. Those with time to kill that enjoyed the book."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "The book? Great. The movie? Meh. Should have titled it \"All About Me\", by Mark Manson. He just goes on and on about himself with a few animations and war clips interspersed throughout. Def annoying and disappointing."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Movie took a very unconventional approach, but it felt needed and accurate."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Seriously…Worth the watch. Breaks down our human tendency to be right, to be stuck in drama, to be good focused on stuff that really doesn't matter."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "Couldn't get through it all."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "That's Quite amazing and great movie"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "At the end of the film he is standing at the edge of a cliff with a safety harness.  So the message it leaves you with is that you should care a little bit but not too much."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Mark Manson helped me become a better person. Instead of trying to feel good all the time, figure out what you're willing to feel bad for. Stoicism with a dollop of Buddhism, but framed in a down-to-earth, modern-day, lens that most Americans born between 1980-2000, will find super relatable.\n\nMark and his books are a 10/10. The documentary (which considering the source material, would be difficult to produce) is a 5/10. But still watch it, you won't be disappointed."}]}}, "emsId": "acd98eb6-c8ef-4dd0-a87d-3983ea801058", "emsVersionId": "750558fd-2fd1-4d4e-aff3-90b4954f8418", "movie_name": "The Subtle Art of Not Giving a #@%!"}