{"data": {"audienceReviews": {"totalCount": 63, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "I absolutely loved it! Typically, I have a hard time with movies, especially when I watch them late at night and after having a few beers. Actually, 99% of the movies I watch end up with me falling asleep before finishing them. But when I watched The Last Deal, I was completely captivated! I didn't even blink once! The music was perfect and set the tone, and the plot was simple yet stunning. There was a particular scene (you know the one) that left my jaw on the floor! It was such a rush! Indie flicks like this one are proving that all you need is a great story, talented actors, and a skilled director to make something special. I absolutely adored this film and would happily watch it again just for the vibe alone."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Really tense.  Dug all the neon and lead actor was well casted.  Knew how to keep my attention."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2, "isInterested": null, "comment": "The acting lacked any emotion, the story was predictable, the dialogue was basic, and thinking any more about it would be to give it more than it deserves."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Dope soundtrack and pretty gritty cinematography"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Beware of all these clearly fake reviews. This movie sucks so bad that I had to set the record straight."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Definitely worth a watch if you're looking for a gritty, action packed movie set in and around LA.  Awesome soundtrack with great production & cast, especially the lead actor who really had you rooting for his character all the way through."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Really cool movie and incredibly engaging.  It flies by too in a jam packed 90 minute thrill ride."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "This movie was bad. I don't understand the positive rotten tomatoes score. The scenes are cheesy. The dialogue is stale. The ending is unsatisfying. Overall, save your $5 to rent this movie on Amazon prime. I wish I could get mine back."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Wow, not what I was expecting.  Very impressive."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is a great film.  Really you should see it!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "No clue this was a micro budget film, extremely well done - felt like a bigger budgeted movie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Moved very fast but engaging and I learned about the cannabis industry"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Awesome indie film.  Reminded me of the 70s gritty downtown LA films.  Fun Friday night watch."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "This movie was so bad it was laughable."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 0.5, "isInterested": null, "comment": "Easily the worst \"film\" I've watched in a long time. Bad acting, bad dialogue, bad writing … I have zero idea how it's 100%. Rent at your own risk."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Really engaging and lead guy's performance is good.  I read they shot the entire movie with no permits. Pretty impressive."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Really enjoyed this.  Not what I expected.  Loved the score and learned something about the cannabis industry."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It's not HEAT or some crazy action film.  It's a solid indie crime movie and tense AF.  Score is solid!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This was actually really good.  Didn't know what to expect since it's a micro-budget film.  It's incredible what they pulled off.  Very tense and had glimmers of Michael Mann.  Kept me entertained, moves pretty fast to not be entertained."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1, "isInterested": null, "comment": "I would've been more entertained by watching a repeat of Shark Tank.  Not the Saturday night action packed thriller we were looking for this evening. Still scratching my head at the 100 tomatoes score that made us choose it."}]}}, "emsId": "79f389d1-0082-46ec-b4af-a8a8ab87c66d", "emsVersionId": "315c4b3c-a9fd-4023-9c10-2f175e344c23", "movie_name": "The Last Deal"}