{"data": {"audienceReviews": {"totalCount": 72, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "This is great example of good script overcoming other short comings. In this case, The Magicians Elephant looks like so many other Netflix animated CGI films, but the movie has some wonderful character moments and great voice acting performances that elevates it above the others.\n\nI'm not sure how would stand up to multiple viewings but kudos to the writers."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "The movie it's very simple, without any further world building, however it doesn't get away from the plot. It shows the importance of don't stop believing, even if it seems impossible. It's a good Netflix's adaptation based on a book, I recommend it if you want just a casual movie."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "The film is very beautiful visually, but it could have been more colorful - showing us different and unique places.  The story is interesting, but not very daring - it's totally stuck in the main narrative.  Some themes needed more depth, but the plot is entertaining.  As much as it was not very creative, it was a pleasant experience and left an extremely positive balance.  The moral lesson is very well crafted, always reminding us how we must never lose hope, regardless of the challenge."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "I enjoyed this movie , emotions hit at perfect moments and overall a new fantastic movie"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "heart warming :) thumbs up"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie had no right to be this good. The amount of character development in such tiny moments... Loved it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The most wholesome and heartfelt film I have watched in a long time. Combined with the beautiful animation style it results in a fantastic viewing experience."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I so love All NETFLIX's movies, animations, and Tv series. it's perfect."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This film was totally charming, both in the story and the artwork.  The characters were  funny and delightful and the town was beautifully drawn and colorful."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "It's a good way to occupy the kids...The colors are very nice and the background looks like a beautiful watercolor painting. The acting is very competent and although the story is okay it is not exactly spellbinding. All-in-all it's just a movie to keep the kids out of your hair for an hour-and-a-half."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 1.5, "isInterested": null, "comment": "Poorly written story/dialogue"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "A great and original movie with a colorful character development and an interesting story. I loved every bit of it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie contains the most important message we can give our children - to have faith that you can accomplish your dreams."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The best family animated film of the year; one of the best to come out in years. Beautiful to watch! Engaging story line. Great values for kids and adults alike."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "I liked this movie. The concept isn't extremely unique or anything, but I still found it enjoyable. Visually I think this movie is great, I love the art style and character designs, which do stand out from a lot of other recent animated movies. Overall nothing groundbreaking but still fun to watch with a nice enough message"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "I enjoyed this film. I guess a middle aged + guy that still enjoys a little bit of magic and escapism away from the daily cynicism and harsh reality of life !"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie is both charming and moving. I also love the book, and wouldn't have guessed it could be successfully adapted—but it was. \n\nIf you don't know the book, you won't guess where it's going. Ultimately it goes to some very deep themes. I recommend this for all ages, and especially for parents to watch with their children."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Heart-felt and absolutely Beautiful! A captivating story, with a important message about resilience, hope and defying the odds. Just as fun for kids and adults alike. A must see!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "There's always a key to making impossible things possible. The determination of the boy to achieve the king's task and the magician's words enlightening the trust or hope that everyone should have over him so that he can achieve well in his profession,  the boy decides to sacrifice his choice of finding his sister and considering the elephant also have a family is touching one. Good to watch, and multiple scenes are there which are remarkable. Worth watching."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Animação belíssima, as cores e texturas passam uma sensação de algo quase artesanal. A história é bem escrita e traz questionamentos importantes tanto para crianças quanto para adultos."}]}}, "emsId": "83483101-e8dd-3d83-b806-640a27a688d9", "emsVersionId": "2f0cd864-edf0-3ff4-93e0-759f02313643", "movie_name": "The Magician's Elephant"}