{"data": {"audienceReviews": {"totalCount": 599173, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is an absolute Pixar masterpiece. The soundtrack is incredible, and the love story told by WALL-E and EVE while barely saying any words is quite literally better than Romeo and Juliet. Go watch this movie right now or the captain of the Axiom will hunt you down."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Great film. Amazing honestly"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Really, Really good!!!!!!!!!!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "there is almost no dialogue in this movie, but it still tells a compelling story, and that's what makes it amazing."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "A true masterpiece. Loved this movie. Best film to come from Pixar in my opinion. Period."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "i loved this movie my son absolutely loved it he literally  jumped out of his seat at the end"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie is perfect."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Benefiting from stellar animation by PIXAR, provided with an outstanding script, direction, and sound, WALL-E is one of the finest and most original films of 2008, and remains one of the best animated films to date."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Beautiful film with a great message about valuing our planet with a cute love story. Honestly one of the best films i've seen, even if it's meant to be a kids film."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "It's one of my favorite movies ever, I have watched it 10 times since i was 6 and it nnever disapoints.\nIt has some of the best visuals I have ever seen and the story is just amazing."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "In my opinion, this is an absolute cinematic masterpiece. Children will enjoy it with all of the action and cute characters, while adults will find a meaningful message inside it. The plot is fun and engaging, but there are so many hidden details in this film that make you want to watch it on repeat."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Part love story, part social satire, part prophetic dystopian future. The first half of the movie contains solely three words along with some beeps and some whirring yet the love story between two robots still manages to be transfixing. The second half of the film boldly calls us all out as complacent, overindulgent consumerists who continue said lifestyle despite the overwhelming evidence of its harm to ourselves and the world. These thematic intricacies are often reserved for more adult films, but the way Pixar manages to take those themes and sand their edges down while still retaining their shape is truly admirable. Juggling all of those pieces with minimal dialogue and a (largely) non-human cast seems near impossible in a kid's movie, but Pixar manages to stick the landing with arguably the most complex and well executed animated film of all time."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Pixar at its best, a story with no words, except for a very slight dialogue. Mostly a story about watching two individual robots, fall in love, and the journey and adventure that they have to embark on. Disney really went all out with this film, you think that it wouldn't be something entertaining for a child, but you understand that when you take away the words, and you have to physically watch and pay attention, a draw your attention more to the screen so you can understand exactly what's going on. Disney did that bold and beautiful with this movie"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "There are some takes in this show that probably wouldn't be done today, but overall is a fun watch."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "One of my top movies. Great story. Adorable characters."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Beautiful. One of Pixar's best, ever."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "The greatest film in the Pixar Lineup, A Beautiful Story, Funny moments, Touching scenes, Its for anyone who likes romance, comedy, and action."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This movie is a Masterpiece i might be a little biased but I loved every nanosecond of it.wall-e was amazing back then and still is."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4.5, "isInterested": null, "comment": "Great and kinda sad adventure."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Amazing film........ however one day in the non too distant future, this will not be personification. 🤖❤️"}]}}, "emsId": "4c42565e-9037-38bb-974f-d24395df2f1e", "emsVersionId": "4b05e4a1-b0c4-3e9b-93ff-f2e8cd4a9045", "movie_name": "WALL-E"}