{"data": {"audienceReviews": {"totalCount": 737, "nextOffset": 20, "hasNextPage": true, "hasPreviousPage": false, "items": [{"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "We got a ghost rings true on many counts.  I think almost every kid and even many adults would love to have a ghost friend.   The reaction of the kid at their first meeting was almost perfect.  What happens after that rings true on many aspects.  So true that you know a lot about what is going to happen with just a few surprises.  But I found it an enjoyable ride. There is a few weak spots in the story line but very few movies are perfect.  I did enjoy watching it and I think the rating for the age group is right.  Overall I give it 4 out of 5 stars."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This film is interesting, it combines several genres into one. Comedy, action, drama, and a touch of horror. Personally I did not mind the combination of themes, I found the story well developed. It was much more funnier than I t hought it would be, so that was another thing to enjoy."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Lots of plot holes there."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I thought it was the ghost busters for a new generation…"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I loved this movie, it was funny and the end was wholesome."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "It's a good time, the character's are great, and the plot was alright in my opinion."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Great story and awesome cast."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Fun movie with a heart warming story, i enjoyed the humor and it doesn't force itself or get in the way of the story."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Loved it!! The camera work, the characters, the actors and their great acting, the directing, the plot, the music... loved it!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "I thought this movie was just a fun comedy to watch. If you want to laugh, watch it."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Very entertaining. David Harbour is excellent!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Delightfully funny and worth watching!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 4, "isInterested": null, "comment": "Surprisingly entertaining. The comedy was well executed and the story just good enough to not be boring or too predictable. Overall good marks. Some bad parts but good job overall."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "I thought it was a funny pre-teen type movie. Good one for the kids!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Fine movie. Entertaining. For all the critics a question: when have you acted, produced, directed or funded a movie? Never? then SFU"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "Very funny and cute!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 2.5, "isInterested": null, "comment": "I liked this movie but it definitely could have token off the extra parts such as Ernest getting locked up by that lady and focused more on Ernest' murder. Kevin and Joy should have stayed as friends instead of being together because it's just like any other story where the guy ends up being with the girl that he has been hanging out with. Overall I liked the premise of the movie. Solid 3/5."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3.5, "isInterested": null, "comment": "Good for a Netflix movie, which honestly are usually disappointing. The CIA part of it honestly probably could be cut, the movie was a little too long, but I understand they're there to kind of put a deadline and rush on us finding out who this ghost is. The story of who he is is touching and sad. Overall I was really surprised how much I enjoyed this!"}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 3, "isInterested": null, "comment": "This is a very fun movie, I mean I thought the trailer looked cool and stuff but I wasn't expecting to like it as much as I did, honestly thought this was gonna be a low 2.5, but nah this is a high 3 star film. I was also surprised by the depth of emotion on this film, that was really cool. Visually I thought most parts were good, there were some in the second half I was like meh. The overall story I thought was really good, the twist however I wasn't fond of, I feel that was my only issue with the story is that twist/reveal. Performances by the cast were really good, but that one TV person with all that make and red hair I found her extremely annoying. Overall a really fun movie that I think you should all see."}, {"userFullName": null, "userImage": null, "iconImage": null, "rating": 5, "isInterested": null, "comment": "This is one of those films that may not get a lot of attention in its first release, but it will certainly stand the test of time. David Harbour is his usual hilarious charismatic self, despite having no actual lines. The writer, Christopher Landon, who is Michael Landon's son, put a lot of his own story into the characters. There is more depth to this film than the critics are seeing. Original, modern story, great cast. Loved it!"}]}}, "emsId": "44395a61-7822-3fca-be96-f35615f57967", "emsVersionId": "0e3f6a2d-4019-34ff-9df0-cc3639ca82b2", "movie_name": "We Have a Ghost"}